         TITLE 'HMASMDS1 - SET CCA FROM SYSTEM ENTRY'                   00001000
HMASMDS1 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'HMASMDS1  78.334'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  LA    @10,4095(,@12)                                      0001 00011000
         USING @PSTART,@12                                         0001 00012000
         USING @PSTART+4095,@10                                    0001 00013000
         ST    @13,@SA00001+4                                      0001 00014000
         LA    @14,@SA00001                                        0001 00015000
         ST    @14,8(,@13)                                         0001 00016000
         LR    @13,@14                                             0001 00017000
         MVC   @PC00001(8),0(@01)                                  0001 00018000
*   DS1RTNCD=ZERO;                  /*                               */ 00019000
         SLR   DS1RTNCD,DS1RTNCD                                   0157 00020000
*   IOPPTR=ADDR(DS1IOP);            /* PTR TO IOP PASSED             */ 00021000
         L     IOPPTR,@PC00001                                     0158 00022000
*   HMASMMGP=''B;                   /* ZERO MSG PARM                 */ 00023000
         XC    HMASMMGP(24),HMASMMGP                               0159 00024000
*   MGPPRINT=ON;                    /* ALL MSG TO PRINTER            */ 00025000
*   MGPHLDS=ON;                     /* ALL MSG TO LOG                */ 00026000
         OI    MGPPRINT,B'10010000'                                0161 00027000
*   OLDPEMAX=CCAPEMAX;              /* SAVE PEMAX ON ENTRY           */ 00028000
*                                                                  0162 00029000
         L     @02,@CA00039                                        0162 00030000
         LH    OLDPEMAX,CCAPEMAX-HMASMCCA(,@02)                    0162 00031000
*   /*****************************************************************/ 00032000
*   /*                                                               */ 00033000
*   /* CALL ROUTINE TO RE-INITIALIZE APPRIPRIATE FIELDS IN CCA BASED */ 00034000
*   /* ON DATASET BEING PROCESSED                                    */ 00035000
*   /*                                                               */ 00036000
*   /*****************************************************************/ 00037000
*                                                                  0163 00038000
*   IF DS1RTNCD=ZERO                /* IF PREVIOUS FUNCTION OK       */ 00039000
*     THEN                          /*                               */ 00040000
         C     DS1RTNCD,@CF00253                                   0163 00041000
         BNE   @RF00163                                            0163 00042000
*     DO;                           /*                               */ 00043000
*       CALL DS1INIT;               /* INIT CCA FIELDS               */ 00044000
         BAL   @14,DS1INIT                                         0165 00045000
*       RFY                                                        0166 00046000
*         RTNCODE RSTD;             /*                               */ 00047000
*       DS1RTNCD=MAX(DS1RTNCD,RTNCODE);/* SAVE RC                    */ 00048000
         CR    DS1RTNCD,RTNCODE                                    0167 00049000
         BNL   *+6                                                      00050000
         LR    DS1RTNCD,RTNCODE                                    0167 00051000
*       RFY                                                        0168 00052000
*         RTNCODE UNRSTD;           /*                               */ 00053000
*     END;                          /*                               */ 00054000
*                                                                  0170 00055000
*   /*****************************************************************/ 00056000
*   /*                                                               */ 00057000
*   /* IF PREVIOUS FUNCTIONS OK THEN LOCATE AND PROCESS SYSTEM ENTRY */ 00058000
*   /* FROM DATASET                                                  */ 00059000
*   /*                                                               */ 00060000
*   /*****************************************************************/ 00061000
*                                                                  0170 00062000
*   IF DS1RTNCD=ZERO                /*                               */ 00063000
*     THEN                          /*                               */ 00064000
@RF00163 C     DS1RTNCD,@CF00253                                   0170 00065000
         BNE   @RF00170                                            0170 00066000
*     DO;                           /*                               */ 00067000
*       CALL DS1SYSLC;              /* LOCATE SYSTEM ENTRY           */ 00068000
         BAL   @14,DS1SYSLC                                        0172 00069000
*       RFY                                                        0173 00070000
*         RTNCODE RSTD;             /*                               */ 00071000
*       DS1RTNCD=MAX(DS1RTNCD,RTNCODE);/* SAVE RC                    */ 00072000
         CR    DS1RTNCD,RTNCODE                                    0174 00073000
         BNL   *+6                                                      00074000
         LR    DS1RTNCD,RTNCODE                                    0174 00075000
*       RFY                                                        0175 00076000
*         RTNCODE UNRSTD;           /*                               */ 00077000
*     END;                          /*                               */ 00078000
*                                                                  0176 00079000
*   /*****************************************************************/ 00080000
*   /*                                                               */ 00081000
*   /* IF PREVIOUS FUNCTIONS WERE OK THEN CALL ROUTINE TO SET FOR    */ 00082000
*   /* THOSE OPTIONS NOT SPECIFIED IN SYSTEM ENTRY                   */ 00083000
*   /*                                                               */ 00084000
*   /*****************************************************************/ 00085000
*                                                                  0177 00086000
*   IF DS1RTNCD=ZERO                /*                               */ 00087000
*     THEN                          /*                               */ 00088000
@RF00170 C     DS1RTNCD,@CF00253                                   0177 00089000
         BNE   @RF00177                                            0177 00090000
*     DO;                           /*                               */ 00091000
*       CALL DS1DFLT;               /*                               */ 00092000
         BAL   @14,DS1DFLT                                         0179 00093000
*       RFY                                                        0180 00094000
*         RTNCODE RSTD;             /*                               */ 00095000
*       DS1RTNCD=MAX(DS1RTNCD,RTNCODE);/* SAVE RC                    */ 00096000
         CR    DS1RTNCD,RTNCODE                                    0181 00097000
         BNL   *+6                                                      00098000
         LR    DS1RTNCD,RTNCODE                                    0181 00099000
*       RFY                                                        0182 00100000
*         RTNCODE UNRSTD;           /*                               */ 00101000
*     END;                          /*                               */ 00102000
*                                                                  0184 00103000
*   /*****************************************************************/ 00104000
*   /*                                                               */ 00105000
*   /* IF ALL PREVIOUS FUNCTIONS DONE OK AND PEMAX VALUE HAS BEEN    */ 00106000
*   /* INCREASED GET NEW IOP                                         */ 00107000
*   /*                                                               */ 00108000
*   /*****************************************************************/ 00109000
*                                                                  0184 00110000
*   IF DS1RTNCD=ZERO                /* PREV FUNCT OK                 */ 00111000
*       &OLDPEMAX<CCAPEMAX          /* PEMAX INCREASED               */ 00112000
*     THEN                          /*                               */ 00113000
@RF00177 C     DS1RTNCD,@CF00253                                   0184 00114000
         BNE   @RF00184                                            0184 00115000
         L     @02,@CA00039                                        0184 00116000
         CH    OLDPEMAX,CCAPEMAX-HMASMCCA(,@02)                    0184 00117000
         BNL   @RF00184                                            0184 00118000
*     DO;                           /*                               */ 00119000
*       CALL DS1GMIOP;              /*                               */ 00120000
         BAL   @14,DS1GMIOP                                        0186 00121000
*       RFY                                                        0187 00122000
*         RTNCODE RSTD;             /*                               */ 00123000
*       DS1RTNCD=MAX(DS1RTNCD,RTNCODE);/* SAVE RC                    */ 00124000
         CR    DS1RTNCD,RTNCODE                                    0188 00125000
         BNL   *+6                                                      00126000
         LR    DS1RTNCD,RTNCODE                                    0188 00127000
*       RFY                                                        0189 00128000
*         RTNCODE UNRSTD;           /*                               */ 00129000
*     END;                          /*                               */ 00130000
*                                                                  0190 00131000
*   /*****************************************************************/ 00132000
*   /*                                                               */ 00133000
*   /* IF ALL PREVIOUS FUNCTIONS DONE OK AND PTS ENTRY PROCESSED CALL*/ 00134000
*   /* ROUTINE TO BLDL FOR UTILITY NAMES                             */ 00135000
*   /*                                                               */ 00136000
*   /*****************************************************************/ 00137000
*                                                                  0191 00138000
*   IF DS1RTNCD=ZERO                /* PREV FUNCT OK                 */ 00139000
*       &IOPDSID=IOPPTS             /* PTS PROCESSED                 */ 00140000
*     THEN                          /*                               */ 00141000
@RF00184 C     DS1RTNCD,@CF00253                                   0191 00142000
         BNE   @RF00191                                            0191 00143000
         CLI   IOPDSID(IOPPTR),6                                   0191 00144000
         BNE   @RF00191                                            0191 00145000
*     DO;                           /*                               */ 00146000
*       CALL HMASMBDL;              /*                               */ 00147000
         L     @15,@CV01266                                        0193 00148000
         BALR  @14,@15                                             0193 00149000
*       RFY                                                        0194 00150000
*         RTNCODE RSTD;             /*                               */ 00151000
*       DS1RTNCD=MAX(DS1RTNCD,RTNCODE);/* SAVE RC                    */ 00152000
         CR    DS1RTNCD,RTNCODE                                    0195 00153000
         BNL   *+6                                                      00154000
         LR    DS1RTNCD,RTNCODE                                    0195 00155000
*       RFY                                                        0196 00156000
*         RTNCODE UNRSTD;           /*                               */ 00157000
*     END;                          /*                               */ 00158000
*                                                                  0197 00159000
*   /*****************************************************************/ 00160000
*   /*                                                               */ 00161000
*   /* RETURN TO CALLER                                              */ 00162000
*   /*                                                               */ 00163000
*   /*****************************************************************/ 00164000
*                                                                  0198 00165000
*   RETURN CODE(DS1RTNCD);          /*                               */ 00166000
@RF00191 LR    @15,DS1RTNCD                                        0198 00167000
         L     @13,4(,@13)                                         0198 00168000
         L     @14,12(,@13)                                        0198 00169000
         LM    @00,@12,20(@13)                                     0198 00170000
         BR    @14                                                 0198 00171000
         EJECT                                                          00172000
*                                                                  0199 00173000
*   /*****************************************************************/ 00174000
*   /*                                                               */ 00175000
*   /* ROUTINE CALLED TO INITIALIZE CCA FIELDS ASSOCIATED WITH THE   */ 00176000
*   /* DATASET SYSTEM ENTRY TO BE PROCESSED                          */ 00177000
*   /*                                                               */ 00178000
*   /*****************************************************************/ 00179000
*                                                                  0199 00180000
*DS1INIT:                           /*                               */ 00181000
*   PROCEDURE;                      /*                               */ 00182000
DS1INIT  STM   @14,@12,12(@13)                                     0199 00183000
*   RFY                                                            0200 00184000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 00185000
*                                                                  0200 00186000
*   /*****************************************************************/ 00187000
*   /*                                                               */ 00188000
*   /* INIT FIELDS TO BE SET FROM CDS SYSTEM ENTRY                   */ 00189000
*   /*                                                               */ 00190000
*   /*****************************************************************/ 00191000
*                                                                  0201 00192000
*   IF IOPDSID=IOPCDS               /*                               */ 00193000
*     THEN                          /*                               */ 00194000
         CLI   IOPDSID(IOPPTR),2                                   0201 00195000
         BNE   @RF00201                                            0201 00196000
*     DO;                           /*                               */ 00197000
*       CCACSYSF=OFF;               /*                               */ 00198000
         L     @02,@CA00039                                        0203 00199000
         NI    CCACSYSF-HMASMCCA(@02),B'01111111'                  0203 00200000
*       CCANUCID=BLANK;             /*                               */ 00201000
         MVI   CCANUCID-HMASMCCA(@02),C' '                         0204 00202000
*       CCACSREL=BLANK;             /*                               */ 00203000
         MVI   CCACSREL-HMASMCCA+1(@02),C' '                       0205 00204000
         MVC   CCACSREL-HMASMCCA+2(2,@02),CCACSREL-HMASMCCA+1(@02) 0205 00205000
         MVI   CCACSREL-HMASMCCA(@02),C' '                         0205 00206000
*       CCACDSID=BLANK;             /*                               */ 00207000
         MVI   CCACDSID-HMASMCCA+1(@02),C' '                       0206 00208000
         MVC   CCACDSID-HMASMCCA+2(6,@02),CCACDSID-HMASMCCA+1(@02) 0206 00209000
         MVI   CCACDSID-HMASMCCA(@02),C' '                         0206 00210000
*       CCAMTSNP=OFF;               /*                               */ 00211000
*       CCASTSNP=OFF;               /*                               */ 00212000
         NI    CCAMTSNP-HMASMCCA(@02),B'10011111'                  0208 00213000
*     END;                          /*                               */ 00214000
*   ELSE                            /* IF NOT CDS                    */ 00215000
*                                                                  0210 00216000
*     /***************************************************************/ 00217000
*     /*                                                             */ 00218000
*     /* INIT FIELDS TO BE SET FROM ACDS SYSTEM ENTRY                */ 00219000
*     /*                                                             */ 00220000
*     /***************************************************************/ 00221000
*                                                                  0210 00222000
*     IF IOPDSID=IOPACDS            /*                               */ 00223000
*       THEN                        /*                               */ 00224000
         B     @RC00201                                            0210 00225000
@RF00201 CLI   IOPDSID(IOPPTR),12                                  0210 00226000
         BNE   @RF00210                                            0210 00227000
*       DO;                         /*                               */ 00228000
*         CCAASYSF=OFF;             /*                               */ 00229000
         L     @02,@CA00039                                        0212 00230000
         NI    CCAASYSF-HMASMCCA(@02),B'10111111'                  0212 00231000
*         CCAASREL=BLANK;           /*                               */ 00232000
         MVI   CCAASREL-HMASMCCA+1(@02),C' '                       0213 00233000
         MVC   CCAASREL-HMASMCCA+2(2,@02),CCAASREL-HMASMCCA+1(@02) 0213 00234000
         MVI   CCAASREL-HMASMCCA(@02),C' '                         0213 00235000
*         CCAACDID=BLANK;           /*                               */ 00236000
         MVI   CCAACDID-HMASMCCA+1(@02),C' '                       0214 00237000
         MVC   CCAACDID-HMASMCCA+2(6,@02),CCAACDID-HMASMCCA+1(@02) 0214 00238000
         MVI   CCAACDID-HMASMCCA(@02),C' '                         0214 00239000
*       END;                        /*                               */ 00240000
*     ELSE                          /* IF NOT ACDS                   */ 00241000
*                                                                  0216 00242000
*       /*************************************************************/ 00243000
*       /*                                                           */ 00244000
*       /* INIT FIELDS TO BE SET FROM PTS SYTEM ENTRY                */ 00245000
*       /*                                                           */ 00246000
*       /*************************************************************/ 00247000
*                                                                  0216 00248000
*       IF IOPDSID=IOPPTS           /*                               */ 00249000
*         THEN                      /*                               */ 00250000
         B     @RC00210                                            0216 00251000
@RF00210 CLI   IOPDSID(IOPPTR),6                                   0216 00252000
         BNE   @RF00216                                            0216 00253000
*         DO;                       /*                               */ 00254000
*           CCAPSYSF=OFF;           /* SYSTEM ENTRY NOT FOUND        */ 00255000
         L     @02,@CA00039                                        0218 00256000
         NI    CCAPSYSF-HMASMCCA(@02),B'11011111'                  0218 00257000
*           CCAPTSNP=OFF;           /* PURGE AT ACCEPT               */ 00258000
*           CCAPTSNJ=OFF;           /* REJECT AT RESTORE             */ 00259000
         NI    CCAPTSNP-HMASMCCA(@02),B'01101111'                  0220 00260000
*           CCALKDNM(1)=BLANK;      /* INIT UTILITY NAMES TO BLANK   */ 00261000
         L     @15,CCABLDLP-HMASMCCA(,@02)                         0221 00262000
         MVI   CCALKDNM(@15),C' '                                  0221 00263000
*           CCAASMNM(1)=BLANK;      /*                               */ 00264000
         MVI   CCAASMNM(@15),C' '                                  0222 00265000
*           CCACPYNM(1)=BLANK;      /*                               */ 00266000
         MVI   CCACPYNM(@15),C' '                                  0223 00267000
*           CCACOMNM(1)=BLANK;      /*                               */ 00268000
         MVI   CCACOMNM(@15),C' '                                  0224 00269000
*           CCAZAPNM(1)=BLANK;      /*                               */ 00270000
         MVI   CCAZAPNM(@15),C' '                                  0225 00271000
*           CCASUPNM(1)=BLANK;      /*                               */ 00272000
         MVI   CCASUPNM(@15),C' '                                  0226 00273000
*           CCAUPDNM(1)=BLANK;      /*                               */ 00274000
         MVI   CCAUPDNM(@15),C' '                                  0227 00275000
*           CCALKDPM(1)=BLANK;      /* INIT UTILITY PARMS TO BLANK   */ 00276000
         MVI   CCALKDPM(@15),C' '                                  0228 00277000
*           CCAASMPM(1)=BLANK;      /*                               */ 00278000
         MVI   CCAASMPM(@15),C' '                                  0229 00279000
*           CCACPYPM(1)=BLANK;      /*                               */ 00280000
         MVI   CCACPYPM(@15),C' '                                  0230 00281000
*           CCACOMPM(1)=BLANK;      /*                               */ 00282000
         MVI   CCACOMPM(@15),C' '                                  0231 00283000
*           CCAZAPPM(1)=BLANK;      /*                               */ 00284000
         MVI   CCAZAPPM(@15),C' '                                  0232 00285000
*           CCASUPPM(1)=BLANK;      /*                               */ 00286000
         MVI   CCASUPPM(@15),C' '                                  0233 00287000
*           CCAUPDPM(1)=BLANK;      /*                               */ 00288000
         MVI   CCAUPDPM(@15),C' '                                  0234 00289000
*           CCALKDSP(1)=BLANK;      /* INIT UTILITY SYSPRINT DDNAME  */ 00290000
         MVI   CCALKDSP(@15),C' '                                  0235 00291000
*           CCAASMSP(1)=BLANK;      /*                               */ 00292000
         MVI   CCAASMSP(@15),C' '                                  0236 00293000
*           CCACPYSP(1)=BLANK;      /*                               */ 00294000
         MVI   CCACPYSP(@15),C' '                                  0237 00295000
*           CCACOMSP(1)=BLANK;      /*                               */ 00296000
         MVI   CCACOMSP(@15),C' '                                  0238 00297000
*           CCAZAPSP(1)=BLANK;      /*                               */ 00298000
         MVI   CCAZAPSP(@15),C' '                                  0239 00299000
*           CCASUPSP(1)=BLANK;      /*                               */ 00300000
         MVI   CCASUPSP(@15),C' '                                  0240 00301000
*           CCAUPDSP(1)=BLANK;      /*                               */ 00302000
         MVI   CCAUPDSP(@15),C' '                                  0241 00303000
*           CCAPGLEN=PGLENDFT;      /* SET DEFAULT SMPOUT PAGE LEN   */ 00304000
         MVC   CCAPGLEN-HMASMCCA(2,@02),@CH00807                   0242 00305000
*           CCALNLEN=LNLENDFT;      /* SET DEFAULT SMPOUT LINE LEN   */ 00306000
         MVC   CCALNLEN-HMASMCCA(2,@02),@CH01284                   0243 00307000
*           CCARASM=ASMRCDFT;       /* SET DEFAULT RETURN CODES      */ 00308000
         MVI   CCARASM(@15),X'04'                                  0244 00309000
*           CCARUPDT=UPDRCDFT;      /*                               */ 00310000
         MVI   CCARUPDT(@15),X'00'                                 0245 00311000
*           CCARLINK=LKDRCDFT;      /*                               */ 00312000
         MVI   CCARLINK(@15),X'08'                                 0246 00313000
*           CCARZAP=ZAPRCDFT;       /*                               */ 00314000
         MVI   CCARZAP(@15),X'04'                                  0247 00315000
*           CCARCOPY=CPYRCDFT;      /*                               */ 00316000
         MVI   CCARCOPY(@15),X'00'                                 0248 00317000
*           CCARCOMP=COMRCDFT;      /*                               */ 00318000
         MVI   CCARCOMP(@15),X'00'                                 0249 00319000
*           CCARSUP=SUPRCDFT;       /*                               */ 00320000
         MVI   CCARSUP(@15),X'00'                                  0250 00321000
*         END;                      /*                               */ 00322000
*                                                                  0251 00323000
*   /*****************************************************************/ 00324000
*   /*                                                               */ 00325000
*   /* RETURN                                                        */ 00326000
*   /*                                                               */ 00327000
*   /*****************************************************************/ 00328000
*                                                                  0252 00329000
*   RETURN CODE(ZERO);              /*                               */ 00330000
@RF00216 DS    0H                                                  0252 00331000
@RC00210 DS    0H                                                  0252 00332000
@RC00201 SLR   @15,@15                                             0252 00333000
         L     @14,12(,@13)                                        0252 00334000
         LM    @00,@12,20(@13)                                     0252 00335000
         BR    @14                                                 0252 00336000
*   END DS1INIT;                    /*                               */ 00337000
         EJECT                                                          00338000
*                                                                  0254 00339000
*   /*****************************************************************/ 00340000
*   /*                                                               */ 00341000
*   /* ROUTINE CALLED TO LOCATE THE SYSTEM ENTRY ON THE SPECIFIED    */ 00342000
*   /* DATASET AND SET THE APPROPRIATE FIELDS IN THE CCA             */ 00343000
*   /*                                                               */ 00344000
*   /*****************************************************************/ 00345000
*                                                                  0254 00346000
*DS1SYSLC:                          /*                               */ 00347000
*   PROCEDURE;                      /*                               */ 00348000
DS1SYSLC STM   @14,@12,@SA00003                                    0254 00349000
*   DECLARE                         /*                               */ 00350000
*     LCRTNCD FIXED(8);             /*                               */ 00351000
*   RFY                                                            0256 00352000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 00353000
*   LCRTNCD=ZERO;                   /*                               */ 00354000
         SLR   LCRTNCD,LCRTNCD                                     0257 00355000
*   IF PRIMED=NO                    /* IF IOP NOT ALREADY PRIMED     */ 00356000
*     THEN                          /*                               */ 00357000
         L     @05,@PC00001+4                                      0258 00358000
         CLI   PRIMED(@05),C'N'                                    0258 00359000
         BNE   @RF00258                                            0258 00360000
*     DO;                           /*                               */ 00361000
*       IOPFUNCT=IOPOPEN;           /* THEN OPEN DATASET             */ 00362000
         MVI   IOPFUNCT(IOPPTR),X'00'                              0260 00363000
*       CALL HMASMIO(HMASMIOP);     /* OPEN DATA SET                 */ 00364000
         ST    IOPPTR,@AL00001                                     0261 00365000
         L     @15,@CV01265                                        0261 00366000
         LA    @01,@AL00001                                        0261 00367000
         BALR  @14,@15                                             0261 00368000
*       IF IOPRETRN=IOPGOOD         /* IF OPEN DONE OK               */ 00369000
*         THEN                      /*                               */ 00370000
         CLI   IOPRETRN(IOPPTR),0                                  0262 00371000
         BNE   @RF00262                                            0262 00372000
*         DO;                       /*                               */ 00373000
*           IOPFUNCT=IOPLOC;        /*                               */ 00374000
         MVI   IOPFUNCT(IOPPTR),X'03'                              0264 00375000
*           IOPTYPE=IOPSYS;         /*                               */ 00376000
         MVI   IOPTYPE(IOPPTR),X'07'                               0265 00377000
*           CALL HMASMIO(HMASMIOP); /* DATASET SYSTEM                */ 00378000
         ST    IOPPTR,@AL00001                                     0266 00379000
         L     @15,@CV01265                                        0266 00380000
         LA    @01,@AL00001                                        0266 00381000
         BALR  @14,@15                                             0266 00382000
*         END;                      /*                               */ 00383000
*     END;                          /*                               */ 00384000
*                                                                  0268 00385000
@RF00262 DS    0H                                                  0269 00386000
*   /*****************************************************************/ 00387000
*   /*                                                               */ 00388000
*   /* PROCESS DATA IF SYSTEM ENTRY AVAILABLE                        */ 00389000
*   /*                                                               */ 00390000
*   /*****************************************************************/ 00391000
*                                                                  0269 00392000
*   IF IOPRETRN=IOPGOOD             /* IF SYS ENTRY AVAILABLE        */ 00393000
*       &IOPFUNCT^=IOPSTOWD         /* AND NOT STOW DELETE. THIS   0269 00394000
*                                      SHOULD BE TREATED AS NOT FOUND   00395000
*                                      CONDITION                     */ 00396000
*     THEN                          /* GET SYSTEM ENTRY              */ 00397000
@RF00258 CLI   IOPRETRN(IOPPTR),0                                  0269 00398000
         BNE   @RF00269                                            0269 00399000
         CLI   IOPFUNCT(IOPPTR),83                                 0269 00400000
         BE    @RF00269                                            0269 00401000
*     DO;                           /*                               */ 00402000
*                                                                  0270 00403000
*       /*************************************************************/ 00404000
*       /*                                                           */ 00405000
*       /* SYSTEM ENTRY IN CURRENT FORMAT AND AT CURRENT CONVERSION  */ 00406000
*       /* LEVEL                                                     */ 00407000
*       /*                                                           */ 00408000
*       /*************************************************************/ 00409000
*                                                                  0271 00410000
*       IF IOPSCNVL=IOPSCNVC        /* IF DATASET AT CURRENT LEVEL   */ 00411000
*         THEN                      /* NO - THEN                     */ 00412000
         CLI   IOPSCNVL(IOPPTR),2                                  0271 00413000
         BNE   @RF00271                                            0271 00414000
*         DO;                       /*                               */ 00415000
*           IF(IOPDSID=IOPCDS       /* IF CDS                        */ 00416000
*               |IOPDSID=IOPACDS)   /* OR ACDS BUT NOT UCLIN         */ 00417000
*               &CCAUPDU=OFF        /* (IE ONLY DURING FIRST CHECK 0273 00418000
*                                      FROM HMASMDSU                 */ 00419000
*             THEN                  /*                               */ 00420000
         CLI   IOPDSID(IOPPTR),2                                   0273 00421000
         BE    @GL00004                                            0273 00422000
         CLI   IOPDSID(IOPPTR),12                                  0273 00423000
         BNE   @RF00273                                            0273 00424000
@GL00004 L     @05,@CA00039                                        0273 00425000
         TM    CCAUPDU-HMASMCCA(@05),B'00000010'                   0273 00426000
         BNZ   @RF00273                                            0273 00427000
*             DO;                   /*                               */ 00428000
*               CALL DS1SLCHK;      /* CHECK DATASET INTEGRITY       */ 00429000
         BAL   @14,DS1SLCHK                                        0275 00430000
*               RFY                                                0276 00431000
*                 RTNCODE RSTD;     /*                               */ 00432000
*               LCRTNCD=MAX(LCRTNCD,RTNCODE);/* SAVE RC              */ 00433000
         CR    LCRTNCD,RTNCODE                                     0277 00434000
         BNL   *+6                                                      00435000
         LR    LCRTNCD,RTNCODE                                     0277 00436000
*             END;                  /*                               */ 00437000
*           IF LCRTNCD=ZERO         /*                               */ 00438000
*             THEN                  /*                               */ 00439000
@RF00273 C     LCRTNCD,@CF00253                                    0279 00440000
         BNE   @RF00279                                            0279 00441000
*             CALL DS1CCAST;        /* SET CCA FIELDS                */ 00442000
         BAL   @14,DS1CCAST                                        0280 00443000
*         END;                      /*                               */ 00444000
*                                                                  0281 00445000
*       /*************************************************************/ 00446000
*       /*                                                           */ 00447000
*       /* SYSTEM ENTRY IN CURRENT FORMAT BUT AT HIGHER CONVERSION   */ 00448000
*       /* LEVEL                                                     */ 00449000
*       /*                                                           */ 00450000
*       /*************************************************************/ 00451000
*                                                                  0282 00452000
*       ELSE                        /*                               */ 00453000
*         DO;                       /*                               */ 00454000
         B     @RC00271                                            0282 00455000
@RF00271 DS    0H                                                  0283 00456000
*           MGPCLEAR=MGPCLEAR&&MGPCLEAR;/* INIT                      */ 00457000
         XC    MGPCLEAR(6),MGPCLEAR                                0283 00458000
*           MGPMGNO1=HMA204I;       /* XXXXXXXX AT XXXXXX FUNC LEVEL    00459000
*                                      THAN CURRENT HMASMP           */ 00460000
         MVC   MGPMGNO1(2),@CH00131                                0284 00461000
*           IF IOPDSID=IOPCDS       /*                               */ 00462000
*             THEN                  /*                               */ 00463000
         CLI   IOPDSID(IOPPTR),2                                   0285 00464000
         BNE   @RF00285                                            0285 00465000
*             MGPVARPT(1)=ADDR(CCADSIDA(IOPCDS));/*                  */ 00466000
         L     @14,@CA00039                                        0286 00467000
         L     @14,CCADSAD-HMASMCCA(,@14)                          0286 00468000
         LA    @14,CCADSIDA+8(,@14)                                0286 00469000
         ST    @14,MGPVARPT                                        0286 00470000
*           ELSE                    /*                               */ 00471000
*             IF IOPDSID=IOPACDS    /*                               */ 00472000
*               THEN                /*                               */ 00473000
         B     @RC00285                                            0287 00474000
@RF00285 CLI   IOPDSID(IOPPTR),12                                  0287 00475000
         BNE   @RF00287                                            0287 00476000
*               MGPVARPT(1)=ADDR(CCADSIDA(IOPACDS));/*               */ 00477000
         L     @14,@CA00039                                        0288 00478000
         L     @14,CCADSAD-HMASMCCA(,@14)                          0288 00479000
         LA    @14,CCADSIDA+88(,@14)                               0288 00480000
         ST    @14,MGPVARPT                                        0288 00481000
*             ELSE                  /*                               */ 00482000
*               MGPVARPT(1)=ADDR(CCADSIDA(IOPPTS));/*                */ 00483000
         B     @RC00287                                            0289 00484000
@RF00287 L     @14,@CA00039                                        0289 00485000
         L     @14,CCADSAD-HMASMCCA(,@14)                          0289 00486000
         LA    @14,CCADSIDA+40(,@14)                               0289 00487000
         ST    @14,MGPVARPT                                        0289 00488000
*           IF IOPSCNVL>IOPSCNVC    /* IF AT HIGHER LVL              */ 00489000
*             THEN                  /*                               */ 00490000
@RC00287 DS    0H                                                  0290 00491000
@RC00285 CLI   IOPSCNVL(IOPPTR),2                                  0290 00492000
         BNH   @RF00290                                            0290 00493000
*             MGPVARPT(2)=ADDR(TXTHIGH);/* HIGHER                    */ 00494000
         LA    @14,@CC01273                                        0291 00495000
         ST    @14,MGPVARPT+4                                      0291 00496000
*           ELSE                    /*                               */ 00497000
*             MGPVARPT(2)=ADDR(TXTLOW);/* AT LOWER                   */ 00498000
         B     @RC00290                                            0292 00499000
@RF00290 LA    @14,@CC01275                                        0292 00500000
         ST    @14,MGPVARPT+4                                      0292 00501000
*           MGPTYPE=MGPTERM;        /* SEVER ERROR                   */ 00502000
@RC00290 MVI   MGPTYPE,X'05'                                       0293 00503000
*           CALL HMASMMSG(HMASMMGP);/*                               */ 00504000
         L     @15,@CV01267                                        0294 00505000
         LA    @01,@AL00294                                        0294 00506000
         BALR  @14,@15                                             0294 00507000
*           LCRTNCD=STOPSMP;        /* TERMINATE SMP                 */ 00508000
         LA    LCRTNCD,16                                          0295 00509000
*         END;                      /*                               */ 00510000
*     END;                          /*                               */ 00511000
*                                                                  0297 00512000
*   /*****************************************************************/ 00513000
*   /*                                                               */ 00514000
*   /* SYSTEM ENTRY NOT LOCATED                                      */ 00515000
*   /*                                                               */ 00516000
*   /*****************************************************************/ 00517000
*                                                                  0298 00518000
*   ELSE                            /*                               */ 00519000
*     DO;                           /*                               */ 00520000
         B     @RC00269                                            0298 00521000
@RF00269 DS    0H                                                  0299 00522000
*       IF IOPRETRN=IOPIOERR        /* IF I/O ERROR                  */ 00523000
*         THEN                      /*                               */ 00524000
         CLI   IOPRETRN(IOPPTR),16                                 0299 00525000
         BNE   @RF00299                                            0299 00526000
*         LCRTNCD=STOPSMP;          /* TERMINATE SMP                 */ 00527000
         LA    LCRTNCD,16                                          0300 00528000
*       ELSE                        /* IF NOT OPEN OR NOT FOUND OR 0301 00529000
*                                      STOW DELETED                  */ 00530000
*         IF IOPDSID=IOPCDS         /*                               */ 00531000
*           THEN                    /*                               */ 00532000
         B     @RC00299                                            0301 00533000
@RF00299 CLI   IOPDSID(IOPPTR),2                                   0301 00534000
         BNE   @RF00301                                            0301 00535000
*           DO;                     /*                               */ 00536000
*             CCACDSC=ON;           /* CDS AT CURRENT LEVEL          */ 00537000
         L     @14,@CA00039                                        0303 00538000
         OI    CCACDSC-HMASMCCA(@14),B'10000000'                   0303 00539000
*           END;                    /*                               */ 00540000
*         ELSE                      /*                               */ 00541000
*           IF IOPDSID=IOPACDS      /*                               */ 00542000
*             THEN                  /*                               */ 00543000
         B     @RC00301                                            0305 00544000
@RF00301 CLI   IOPDSID(IOPPTR),12                                  0305 00545000
         BNE   @RF00305                                            0305 00546000
*             DO;                   /*                               */ 00547000
*               CCAACDSC=ON;        /* ACDS AT CURRENT LEVEL         */ 00548000
         L     @14,@CA00039                                        0307 00549000
         OI    CCAACDSC-HMASMCCA(@14),B'01000000'                  0307 00550000
*             END;                  /*                               */ 00551000
*     END;                          /*                               */ 00552000
@RF00305 DS    0H                                                  0309 00553000
@RC00301 DS    0H                                                  0309 00554000
@RC00299 DS    0H                                                  0310 00555000
*   RETURN CODE(LCRTNCD);           /*                               */ 00556000
@RC00269 LR    @15,LCRTNCD                                         0310 00557000
         L     @14,@SA00003                                        0310 00558000
         LM    @00,@12,@SA00003+8                                  0310 00559000
         BR    @14                                                 0310 00560000
*   END DS1SYSLC;                   /*                               */ 00561000
         EJECT                                                          00562000
*                                                                  0312 00563000
*   /*****************************************************************/ 00564000
*   /*                                                               */ 00565000
*   /* ROUTINE TO CHECK FOR DATASET INTEGRITY OF CDS AND ACDS        */ 00566000
*   /*                                                               */ 00567000
*   /*****************************************************************/ 00568000
*                                                                  0312 00569000
*DS1SLCHK:                          /*                               */ 00570000
*   PROCEDURE;                      /*                               */ 00571000
DS1SLCHK STM   @14,@12,@SA00004                                    0312 00572000
*   RFY                                                            0313 00573000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 00574000
*   DECLARE                                                        0314 00575000
*     SLRC FIXED(8);                /*                               */ 00576000
*   DECLARE                         /*                               */ 00577000
*     SAVFUNCT FIXED(8),            /* FOR IOPFUNCT                  */ 00578000
*     SAVRETRN FIXED(8);            /* FOR IOPRETRN                  */ 00579000
*   SLRC=ZERO;                      /*                               */ 00580000
         SLR   SLRC,SLRC                                           0316 00581000
*   IF IOPSYNG=ON                   /* IF ERR IN DIR REWRITE         */ 00582000
*     THEN                          /*                               */ 00583000
         TM    IOPSYNG(IOPPTR),B'00010000'                         0317 00584000
         BNO   @RF00317                                            0317 00585000
*     DO;                           /*                               */ 00586000
*       MGPCLEAR=''B;               /*                               */ 00587000
         XC    MGPCLEAR(6),MGPCLEAR                                0319 00588000
*       MGPMGNO1=HMA367I;           /* XXXXXXXX IS UNUSEABLE DUE TO     00589000
*                                      PARTIAL DIRECTORY REWRITE     */ 00590000
         MVC   MGPMGNO1(2),@CH01064                                0320 00591000
*       IF IOPDSID=IOPCDS           /*                               */ 00592000
*         THEN                      /*                               */ 00593000
         CLI   IOPDSID(IOPPTR),2                                   0321 00594000
         BNE   @RF00321                                            0321 00595000
*         MGPVARPT(1)=ADDR(CCADSIDA(IOPCDS));/*                      */ 00596000
         L     @14,@CA00039                                        0322 00597000
         L     @14,CCADSAD-HMASMCCA(,@14)                          0322 00598000
         LA    @14,CCADSIDA+8(,@14)                                0322 00599000
         ST    @14,MGPVARPT                                        0322 00600000
*       ELSE                        /*                               */ 00601000
*         MGPVARPT(1)=ADDR(CCADSIDA(IOPACDS));/*                     */ 00602000
         B     @RC00321                                            0323 00603000
@RF00321 L     @14,@CA00039                                        0323 00604000
         L     @14,CCADSAD-HMASMCCA(,@14)                          0323 00605000
         LA    @14,CCADSIDA+88(,@14)                               0323 00606000
         ST    @14,MGPVARPT                                        0323 00607000
*       MGPTYPE=MGPTERM;            /*                               */ 00608000
@RC00321 MVI   MGPTYPE,X'05'                                       0324 00609000
*       CALL HMASMMSG(HMASMMGP);    /*                               */ 00610000
         L     @15,@CV01267                                        0325 00611000
         LA    @01,@AL00325                                        0325 00612000
         BALR  @14,@15                                             0325 00613000
*       SLRC=STOPSMP;               /*                               */ 00614000
         LA    SLRC,16                                             0326 00615000
*     END;                          /*                               */ 00616000
*   ELSE                            /*                               */ 00617000
*     IF IOPSYDL=ON                 /* IF DOWNLEVEL                  */ 00618000
*       THEN                        /*                               */ 00619000
         B     @RC00317                                            0328 00620000
@RF00317 TM    IOPSYDL(IOPPTR),B'00100000'                         0328 00621000
         BNO   @RF00328                                            0328 00622000
*       DO;                         /*                               */ 00623000
*         MGPCLEAR=''B;             /*                               */ 00624000
         XC    MGPCLEAR(6),MGPCLEAR                                0330 00625000
*         MGPMGNO1=HMA366I;         /* XXXXXXXX MAY BE REFLECT THE 0331 00626000
*                                      TRUE STATUS OF LIBRARIES      */ 00627000
         MVC   MGPMGNO1(2),@CH01062                                0331 00628000
*         IF IOPDSID=IOPCDS         /*                               */ 00629000
*           THEN                    /*                               */ 00630000
         CLI   IOPDSID(IOPPTR),2                                   0332 00631000
         BNE   @RF00332                                            0332 00632000
*           MGPVARPT(1)=ADDR(CCADSIDA(IOPCDS));/*                    */ 00633000
         L     @14,@CA00039                                        0333 00634000
         L     @14,CCADSAD-HMASMCCA(,@14)                          0333 00635000
         LA    @14,CCADSIDA+8(,@14)                                0333 00636000
         ST    @14,MGPVARPT                                        0333 00637000
*         ELSE                      /*                               */ 00638000
*           MGPVARPT(1)=ADDR(CCADSIDA(IOPACDS));/*                   */ 00639000
         B     @RC00332                                            0334 00640000
@RF00332 L     @14,@CA00039                                        0334 00641000
         L     @14,CCADSAD-HMASMCCA(,@14)                          0334 00642000
         LA    @14,CCADSIDA+88(,@14)                               0334 00643000
         ST    @14,MGPVARPT                                        0334 00644000
*         MGPTYPE=MGPWARN;          /*                               */ 00645000
@RC00332 MVI   MGPTYPE,X'02'                                       0335 00646000
*         CALL HMASMMSG(HMASMMGP);  /*                               */ 00647000
         L     @15,@CV01267                                        0336 00648000
         LA    @01,@AL00336                                        0336 00649000
         BALR  @14,@15                                             0336 00650000
*         IOPSYDL=OFF;              /* TURN DOWN LEVEL OFF           */ 00651000
         NI    IOPSYDL(IOPPTR),B'11011111'                         0337 00652000
*         SAVFUNCT=IOPFUNCT;        /*                               */ 00653000
         SLR   SAVFUNCT,SAVFUNCT                                   0338 00654000
         IC    SAVFUNCT,IOPFUNCT(,IOPPTR)                          0338 00655000
*         SAVRETRN=IOPRETRN;        /*                               */ 00656000
         SLR   SAVRETRN,SAVRETRN                                   0339 00657000
         IC    SAVRETRN,IOPRETRN(,IOPPTR)                          0339 00658000
*         IOPFUNCT=IOPUDEO;         /*                               */ 00659000
         MVI   IOPFUNCT(IOPPTR),X'56'                              0340 00660000
*         CALL HMASMIO(HMASMIOP);   /* STOW SYSTEM ENTRY BACK TO     */ 00661000
         ST    IOPPTR,@AL00001                                     0341 00662000
         L     @15,@CV01265                                        0341 00663000
         LA    @01,@AL00001                                        0341 00664000
         BALR  @14,@15                                             0341 00665000
*         SLRC=MAX(PTFWARN,IOPRETRN);/* DATASET THEN RESET IOP       */ 00666000
         SLR   SLRC,SLRC                                           0342 00667000
         IC    SLRC,IOPRETRN(,IOPPTR)                              0342 00668000
         LA    @14,4                                               0342 00669000
         CR    SLRC,@14                                            0342 00670000
         BNL   *+6                                                      00671000
         LR    SLRC,@14                                            0342 00672000
*         IOPFUNCT=SAVFUNCT;        /* AS IT WAS ON ENTRY            */ 00673000
         STC   SAVFUNCT,IOPFUNCT(,IOPPTR)                          0343 00674000
*         IOPRETRN=SAVRETRN;        /*                               */ 00675000
         STC   SAVRETRN,IOPRETRN(,IOPPTR)                          0344 00676000
*       END;                        /*                               */ 00677000
*   RETURN CODE(SLRC);              /*                               */ 00678000
@RF00328 DS    0H                                                  0346 00679000
@RC00317 LR    @15,SLRC                                            0346 00680000
         L     @14,@SA00004                                        0346 00681000
         LM    @00,@12,@SA00004+8                                  0346 00682000
         BR    @14                                                 0346 00683000
*   END DS1SLCHK;                   /*                               */ 00684000
         EJECT                                                          00685000
*                                                                  0348 00686000
*   /*****************************************************************/ 00687000
*   /*                                                               */ 00688000
*   /* ROUTINE CALLED TO SET THE APPROPRIATE CCA FIELDS BASED ON THE */ 00689000
*   /* DATA IN THE CURRECT SYSTEM IOP                                */ 00690000
*   /*                                                               */ 00691000
*   /*****************************************************************/ 00692000
*                                                                  0348 00693000
*DS1CCAST:                          /*                               */ 00694000
*   PROCEDURE;                      /*                               */ 00695000
DS1CCAST STM   @14,@12,12(@13)                                     0348 00696000
*   RFY                                                            0349 00697000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 00698000
*   IF IOPDSID=IOPCDS               /* IF CDS SYSTEM ENTRY           */ 00699000
*     THEN                          /*                               */ 00700000
         CLI   IOPDSID(IOPPTR),2                                   0350 00701000
         BNE   @RF00350                                            0350 00702000
*     DO;                           /*                               */ 00703000
*       CCACSYSF=ON;                /* CDS SYSTEM ENTRY FOUND        */ 00704000
         L     @14,@CA00039                                        0352 00705000
         OI    CCACSYSF-HMASMCCA(@14),B'10000000'                  0352 00706000
*       CCACDSC=ON;                 /* CDS AT CURRENT LEVEL          */ 00707000
         OI    CCACDSC-HMASMCCA(@14),B'10000000'                   0353 00708000
*       CCAIOPCS->IOPCDMAP=IOPCDMAP;/* MOVE CDS SYSTEM ENTRY       0354 00709000
*                                      DIRECTORY DATA TO SAVE AREA IN   00710000
*                                      CCA                           */ 00711000
         L     @02,CCAIOPCS-HMASMCCA(,@14)                         0354 00712000
         MVC   IOPCDMAP(36,@02),IOPCDMAP(IOPPTR)                   0354 00713000
*       CCAPEMAX=MAX(CCAPEMAX,IOPPEMAX);/* UPDATE PEMAX UNLESS     0355 00714000
*                                      ALREADY LARGER                */ 00715000
         LH    @02,CCAPEMAX-HMASMCCA(,@14)                         0355 00716000
         LH    @09,IOPPEMAX(,IOPPTR)                               0355 00717000
         CR    @02,@09                                             0355 00718000
         BNL   *+6                                                      00719000
         LR    @02,@09                                             0355 00720000
         STH   @02,CCAPEMAX-HMASMCCA(,@14)                         0355 00721000
*       IF IOPMTSNP=ON              /* IF NO MTS PURGE               */ 00722000
*         THEN                      /*                               */ 00723000
         TM    IOPMTSNP(IOPPTR),B'10000000'                        0356 00724000
         BNO   @RF00356                                            0356 00725000
*         CCAMTSNP=ON;              /* SET IN CCA                    */ 00726000
         OI    CCAMTSNP-HMASMCCA(@14),B'01000000'                  0357 00727000
*       IF IOPSTSNP=ON              /* IF NO STS PURGE               */ 00728000
*         THEN                      /*                               */ 00729000
@RF00356 TM    IOPSTSNP(IOPPTR),B'01000000'                        0358 00730000
         BNO   @RF00358                                            0358 00731000
*         CCASTSNP=ON;              /* SET IN CCA                    */ 00732000
         L     @14,@CA00039                                        0359 00733000
         OI    CCASTSNP-HMASMCCA(@14),B'00100000'                  0359 00734000
*       IF IOPFUNCT^=IOPBLDL        /* IF TOTAL ENTRY IN BUFFER      */ 00735000
*         THEN                      /* THEN PROCESS DATA IN EXTENDED */ 00736000
@RF00358 CLI   IOPFUNCT(IOPPTR),4                                  0360 00737000
         BE    @RF00360                                            0360 00738000
*         DO;                       /* AREA                          */ 00739000
*           CCACSREL=IOPSREL;       /* SAVE SREL                     */ 00740000
         L     @14,@CA00039                                        0362 00741000
         MVC   CCACSREL-HMASMCCA(4,@14),IOPSREL(IOPPTR)            0362 00742000
*           CCANUCID=IOPNUCID;      /* SAVE NUCID                    */ 00743000
         MVC   CCANUCID-HMASMCCA(1,@14),IOPNUCID(IOPPTR)           0363 00744000
*           CCACDSID=IOPSYSID;      /* SYSTEM ID                     */ 00745000
         MVC   CCACDSID-HMASMCCA(8,@14),IOPSYSID(IOPPTR)           0364 00746000
*         END;                      /*                               */ 00747000
*     END;                          /*                               */ 00748000
*   ELSE                            /* IF ACDS SYSTEM ENTRY          */ 00749000
*     IF IOPDSID=IOPACDS            /*                               */ 00750000
*       THEN                        /*                               */ 00751000
         B     @RC00350                                            0367 00752000
@RF00350 CLI   IOPDSID(IOPPTR),12                                  0367 00753000
         BNE   @RF00367                                            0367 00754000
*       DO;                         /*                               */ 00755000
*         CCAASYSF=ON;              /* ACDS SYSTEM ENTRY FOUND       */ 00756000
         L     @14,@CA00039                                        0369 00757000
         OI    CCAASYSF-HMASMCCA(@14),B'01000000'                  0369 00758000
*         CCAACDSC=ON;              /* ACDS AT CURRENT LEVEL         */ 00759000
         OI    CCAACDSC-HMASMCCA(@14),B'01000000'                  0370 00760000
*         CCAIOPAS->IOPCDMAP=IOPCDMAP;/* MOVE ACDS SYSTEM ENTRY    0371 00761000
*                                      DIRECTORY DATA TO SAVE AREA IN   00762000
*                                      CCA                           */ 00763000
         L     @02,CCAIOPAS-HMASMCCA(,@14)                         0371 00764000
         MVC   IOPCDMAP(36,@02),IOPCDMAP(IOPPTR)                   0371 00765000
*         CCAPEMAX=MAX(CCAPEMAX,IOPPEMAX);/* UPDATE PEMAX UNLESS   0372 00766000
*                                      ALREADY LARGER                */ 00767000
         LH    @02,CCAPEMAX-HMASMCCA(,@14)                         0372 00768000
         LH    @09,IOPPEMAX(,IOPPTR)                               0372 00769000
         CR    @02,@09                                             0372 00770000
         BNL   *+6                                                      00771000
         LR    @02,@09                                             0372 00772000
         STH   @02,CCAPEMAX-HMASMCCA(,@14)                         0372 00773000
*         IF IOPFUNCT^=IOPBLDL      /* IF TOTAL ENTRY IN BUFFER      */ 00774000
*           THEN                    /* THEN PROCESS DATA IN EXTENDED */ 00775000
         CLI   IOPFUNCT(IOPPTR),4                                  0373 00776000
         BE    @RF00373                                            0373 00777000
*           DO;                     /* AREA                          */ 00778000
*             CCAASREL=IOPSREL;     /* SET ACDS SREL                 */ 00779000
         MVC   CCAASREL-HMASMCCA(4,@14),IOPSREL(IOPPTR)            0375 00780000
*             CCAACDID=IOPSYSID;    /* SYSTEM ID                     */ 00781000
         MVC   CCAACDID-HMASMCCA(8,@14),IOPSYSID(IOPPTR)           0376 00782000
*           END;                    /*                               */ 00783000
*       END;                        /*                               */ 00784000
*     ELSE                          /*                               */ 00785000
*       IF IOPDSID=IOPPTS           /* IF PTS SYSTEM ENTRY           */ 00786000
*         THEN                      /*                               */ 00787000
         B     @RC00367                                            0379 00788000
@RF00367 CLI   IOPDSID(IOPPTR),6                                   0379 00789000
         BNE   @RF00379                                            0379 00790000
*         DO;                       /*                               */ 00791000
*           CCAPSYSF=ON;            /* PTS SYSSTEM ENTRY FOUND       */ 00792000
         L     @14,@CA00039                                        0381 00793000
         OI    CCAPSYSF-HMASMCCA(@14),B'00100000'                  0381 00794000
*           CCAPEMAX=MAX(CCAPEMAX,IOPPTPEM);/* SET PEMAX             */ 00795000
         LH    @02,CCAPEMAX-HMASMCCA(,@14)                         0382 00796000
         LH    @09,IOPPTPEM(,IOPPTR)                               0382 00797000
         CR    @02,@09                                             0382 00798000
         BNL   *+6                                                      00799000
         LR    @02,@09                                             0382 00800000
         STH   @02,CCAPEMAX-HMASMCCA(,@14)                         0382 00801000
*           IF IOPFUNCT^=IOPBLDL    /* IF TOTAL ENTRY AVAIL          */ 00802000
*             THEN                  /*                               */ 00803000
         CLI   IOPFUNCT(IOPPTR),4                                  0383 00804000
         BE    @RF00383                                            0383 00805000
*             DO;                   /*                               */ 00806000
*               IF IOPPTSNP=ON      /* IF NO PTS PURGE               */ 00807000
*                 THEN              /*                               */ 00808000
         TM    IOPPTSNP(IOPPTR),B'10000000'                        0385 00809000
         BNO   @RF00385                                            0385 00810000
*                 CCAPTSNP=ON;      /* SET IN CCA                    */ 00811000
         OI    CCAPTSNP-HMASMCCA(@14),B'10000000'                  0386 00812000
*               IF IOPPTSNJ=ON      /* IF NO REJ AT RST              */ 00813000
*                 THEN              /*                               */ 00814000
@RF00385 TM    IOPPTSNJ(IOPPTR),B'01000000'                        0387 00815000
         BNO   @RF00387                                            0387 00816000
*                 CCAPTSNJ=ON;      /* SET IN CCA                    */ 00817000
*                                                                  0388 00818000
         L     @14,@CA00039                                        0388 00819000
         OI    CCAPTSNJ-HMASMCCA(@14),B'00010000'                  0388 00820000
*               /*****************************************************/ 00821000
*               /*                                                   */ 00822000
*               /* PROCESS PROGRAM NAMES                             */ 00823000
*               /*                                                   */ 00824000
*               /*****************************************************/ 00825000
*                                                                  0389 00826000
*               IF IOPSYLKD(1)^=BLANK/* AND ONE IN SYS ENT           */ 00827000
*                 THEN              /* THEN MOVE                     */ 00828000
@RF00387 CLI   IOPSYLKD(IOPPTR),C' '                               0389 00829000
         BE    @RF00389                                            0389 00830000
*                 CCALKDNM=IOPSYLKD;/* NAME IN SYS TO CCA            */ 00831000
         L     @14,@CA00039                                        0390 00832000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0390 00833000
         MVC   CCALKDNM(8,@14),IOPSYLKD(IOPPTR)                    0390 00834000
*               IF IOPSYASM(1)^=BLANK/* AND ONE IN SYS ENT           */ 00835000
*                 THEN              /* THEN MOVE                     */ 00836000
@RF00389 CLI   IOPSYASM(IOPPTR),C' '                               0391 00837000
         BE    @RF00391                                            0391 00838000
*                 CCAASMNM=IOPSYASM;/* NAME IN SYS TO CCA            */ 00839000
         L     @14,@CA00039                                        0392 00840000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0392 00841000
         MVC   CCAASMNM(8,@14),IOPSYASM(IOPPTR)                    0392 00842000
*               IF IOPSYCPY(1)^=BLANK/* AND ONE IN SYS ENT           */ 00843000
*                 THEN              /* THEN MOVE                     */ 00844000
@RF00391 CLI   IOPSYCPY(IOPPTR),C' '                               0393 00845000
         BE    @RF00393                                            0393 00846000
*                 CCACPYNM=IOPSYCPY;/* NAME IN SYS TO CCA            */ 00847000
         L     @14,@CA00039                                        0394 00848000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0394 00849000
         MVC   CCACPYNM(8,@14),IOPSYCPY(IOPPTR)                    0394 00850000
*               IF IOPSYCOM(1)^=BLANK/* AND ONE IN SYS ENT           */ 00851000
*                 THEN              /* THEN MOVE                     */ 00852000
@RF00393 CLI   IOPSYCOM(IOPPTR),C' '                               0395 00853000
         BE    @RF00395                                            0395 00854000
*                 CCACOMNM=IOPSYCOM;/* NAME IN SYS TO CCA            */ 00855000
         L     @14,@CA00039                                        0396 00856000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0396 00857000
         MVC   CCACOMNM(8,@14),IOPSYCOM(IOPPTR)                    0396 00858000
*               IF IOPSYZAP(1)^=BLANK/* AND ONE IN SYS ENT           */ 00859000
*                 THEN              /* THEN MOVE                     */ 00860000
@RF00395 CLI   IOPSYZAP(IOPPTR),C' '                               0397 00861000
         BE    @RF00397                                            0397 00862000
*                 CCAZAPNM=IOPSYZAP;/* NAME IN SYS TO CCA            */ 00863000
         L     @14,@CA00039                                        0398 00864000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0398 00865000
         MVC   CCAZAPNM(8,@14),IOPSYZAP(IOPPTR)                    0398 00866000
*               IF IOPSYSUP(1)^=BLANK/* AND ONE IN SYS ENT           */ 00867000
*                 THEN              /* THEN MOVE                     */ 00868000
@RF00397 CLI   IOPSYSUP(IOPPTR),C' '                               0399 00869000
         BE    @RF00399                                            0399 00870000
*                 CCASUPNM=IOPSYSUP;/* NAME IN SYS TO CCA            */ 00871000
         L     @14,@CA00039                                        0400 00872000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0400 00873000
         MVC   CCASUPNM(8,@14),IOPSYSUP(IOPPTR)                    0400 00874000
*               IF IOPSYUPD(1)^=BLANK/* AND ONE IN SYS ENT           */ 00875000
*                 THEN              /* THEN MOVE                     */ 00876000
@RF00399 CLI   IOPSYUPD(IOPPTR),C' '                               0401 00877000
         BE    @RF00401                                            0401 00878000
*                 CCAUPDNM=IOPSYUPD;/* NAME IN SYS TO CCA            */ 00879000
*                                                                  0402 00880000
         L     @14,@CA00039                                        0402 00881000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0402 00882000
         MVC   CCAUPDNM(8,@14),IOPSYUPD(IOPPTR)                    0402 00883000
*               /*****************************************************/ 00884000
*               /*                                                   */ 00885000
*               /* PROCESS PROGRAM PARAMETERS                        */ 00886000
*               /*                                                   */ 00887000
*               /*****************************************************/ 00888000
*                                                                  0403 00889000
*               IF IOPSYLKP(1)^=BLANK/* AND ONE IN SYS ENT           */ 00890000
*                 THEN              /* THEN MOVE                     */ 00891000
@RF00401 CLI   IOPSYLKP(IOPPTR),C' '                               0403 00892000
         BE    @RF00403                                            0403 00893000
*                 CCALKDPM=IOPSYLKP;/* PARM IN SYS TO CCA            */ 00894000
         L     @14,@CA00039                                        0404 00895000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0404 00896000
         MVC   CCALKDPM(100,@14),IOPSYLKP(IOPPTR)                  0404 00897000
*               IF IOPSYASP(1)^=BLANK/* AND ONE IN SYS ENT           */ 00898000
*                 THEN              /* THEN MOVE                     */ 00899000
@RF00403 CLI   IOPSYASP(IOPPTR),C' '                               0405 00900000
         BE    @RF00405                                            0405 00901000
*                 CCAASMPM=IOPSYASP;/* PARM IN SYS TO CCA            */ 00902000
         L     @14,@CA00039                                        0406 00903000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0406 00904000
         MVC   CCAASMPM(100,@14),IOPSYASP(IOPPTR)                  0406 00905000
*               IF IOPSYCPP(1)^=BLANK/* AND ONE IN SYS ENT           */ 00906000
*                 THEN              /* THEN MOVE                     */ 00907000
@RF00405 CLI   IOPSYCPP(IOPPTR),C' '                               0407 00908000
         BE    @RF00407                                            0407 00909000
*                 CCACPYPM=IOPSYCPP;/* PARM IN SYS TO CCA            */ 00910000
         L     @14,@CA00039                                        0408 00911000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0408 00912000
         MVC   CCACPYPM(100,@14),IOPSYCPP(IOPPTR)                  0408 00913000
*               IF IOPSYCOP(1)^=BLANK/* AND ONE IN SYS ENT           */ 00914000
*                 THEN              /* THEN MOVE                     */ 00915000
@RF00407 CLI   IOPSYCOP(IOPPTR),C' '                               0409 00916000
         BE    @RF00409                                            0409 00917000
*                 CCACOMPM=IOPSYCOP;/* PARM IN SYS TO CCA            */ 00918000
         L     @14,@CA00039                                        0410 00919000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0410 00920000
         MVC   CCACOMPM(100,@14),IOPSYCOP(IOPPTR)                  0410 00921000
*               IF IOPSYZPP(1)^=BLANK/* AND ONE IN SYS ENT           */ 00922000
*                 THEN              /* THEN MOVE                     */ 00923000
@RF00409 CLI   IOPSYZPP(IOPPTR),C' '                               0411 00924000
         BE    @RF00411                                            0411 00925000
*                 CCAZAPPM=IOPSYZAP;/* PARM IN SYS TO CCA            */ 00926000
         L     @14,@CA00039                                        0412 00927000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0412 00928000
         MVI   CCAZAPPM+8(@14),C' '                                0412 00929000
         MVC   CCAZAPPM+9(91,@14),CCAZAPPM+8(@14)                  0412 00930000
         MVC   CCAZAPPM(8,@14),IOPSYZAP(IOPPTR)                    0412 00931000
*               IF IOPSYSPP(1)^=BLANK/* AND ONE IN SYS ENT           */ 00932000
*                 THEN              /* THEN MOVE                     */ 00933000
@RF00411 CLI   IOPSYSPP(IOPPTR),C' '                               0413 00934000
         BE    @RF00413                                            0413 00935000
*                 CCASUPPM=IOPSYSPP;/* PARM IN SYS TO CCA            */ 00936000
         L     @14,@CA00039                                        0414 00937000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0414 00938000
         MVC   CCASUPPM(100,@14),IOPSYSPP(IOPPTR)                  0414 00939000
*               IF IOPSYUPP(1)^=BLANK/* AND ONE IN SYS ENT           */ 00940000
*                 THEN              /* THEN MOVE                     */ 00941000
@RF00413 CLI   IOPSYUPP(IOPPTR),C' '                               0415 00942000
         BE    @RF00415                                            0415 00943000
*                 CCAUPDPM=IOPSYUPP;/* PARM IN SYS TO CCA            */ 00944000
*                                                                  0416 00945000
         L     @14,@CA00039                                        0416 00946000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0416 00947000
         MVC   CCAUPDPM(100,@14),IOPSYUPP(IOPPTR)                  0416 00948000
*               /*****************************************************/ 00949000
*               /*                                                   */ 00950000
*               /* PROCESS SYSPRINT DD NAMES                         */ 00951000
*               /*                                                   */ 00952000
*               /*****************************************************/ 00953000
*                                                                  0417 00954000
*               IF IOPSYLKS(1)^=BLANK/* AND ONE IN SYS ENT           */ 00955000
*                 THEN              /* THEN MOVE                     */ 00956000
@RF00415 CLI   IOPSYLKS(IOPPTR),C' '                               0417 00957000
         BE    @RF00417                                            0417 00958000
*                 CCALKDSP=IOPSYLKS;/* SYSPRINT DD IN SYS TO CCA     */ 00959000
         L     @14,@CA00039                                        0418 00960000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0418 00961000
         MVC   CCALKDSP(8,@14),IOPSYLKS(IOPPTR)                    0418 00962000
*               IF IOPSYASS(1)^=BLANK/* AND ONE IN SYS ENT           */ 00963000
*                 THEN              /* THEN MOVE                     */ 00964000
@RF00417 CLI   IOPSYASS(IOPPTR),C' '                               0419 00965000
         BE    @RF00419                                            0419 00966000
*                 CCAASMSP=IOPSYASS;/* SYSPRINT DD IN SYS TO CCA     */ 00967000
         L     @14,@CA00039                                        0420 00968000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0420 00969000
         MVC   CCAASMSP(8,@14),IOPSYASS(IOPPTR)                    0420 00970000
*               IF IOPSYCPS(1)^=BLANK/* AND ONE IN SYS ENT           */ 00971000
*                 THEN              /* THEN MOVE                     */ 00972000
@RF00419 CLI   IOPSYCPS(IOPPTR),C' '                               0421 00973000
         BE    @RF00421                                            0421 00974000
*                 CCACPYSP=IOPSYCPS;/* SYSPRINT DD IN SYS TO CCA     */ 00975000
         L     @14,@CA00039                                        0422 00976000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0422 00977000
         MVC   CCACPYSP(8,@14),IOPSYCPS(IOPPTR)                    0422 00978000
*               IF IOPSYCOS(1)^=BLANK/* AND ONE IN SYS ENT           */ 00979000
*                 THEN              /* THEN MOVE                     */ 00980000
@RF00421 CLI   IOPSYCOS(IOPPTR),C' '                               0423 00981000
         BE    @RF00423                                            0423 00982000
*                 CCACOMSP=IOPSYCOS;/* SYSPRINT DD IN SYS TO CCA     */ 00983000
         L     @14,@CA00039                                        0424 00984000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0424 00985000
         MVC   CCACOMSP(8,@14),IOPSYCOS(IOPPTR)                    0424 00986000
*               IF IOPSYZPS(1)^=BLANK/* AND ONE IN SYS ENT           */ 00987000
*                 THEN              /* THEN MOVE                     */ 00988000
@RF00423 CLI   IOPSYZPS(IOPPTR),C' '                               0425 00989000
         BE    @RF00425                                            0425 00990000
*                 CCAZAPSP=IOPSYZPS;/* SYSPRINT DD IN SYS TO CCA     */ 00991000
         L     @14,@CA00039                                        0426 00992000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0426 00993000
         MVC   CCAZAPSP(8,@14),IOPSYZPS(IOPPTR)                    0426 00994000
*               IF IOPSYSPS(1)^=BLANK/* AND ONE IN SYS ENT           */ 00995000
*                 THEN              /* THEN MOVE                     */ 00996000
@RF00425 CLI   IOPSYSPS(IOPPTR),C' '                               0427 00997000
         BE    @RF00427                                            0427 00998000
*                 CCASUPSP=IOPSYSPS;/* SYSPRINT DD IN SYS TO CCA     */ 00999000
         L     @14,@CA00039                                        0428 01000000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0428 01001000
         MVC   CCASUPSP(8,@14),IOPSYSPS(IOPPTR)                    0428 01002000
*               IF IOPSYUPS(1)^=BLANK/* AND ONE IN SYS ENT           */ 01003000
*                 THEN              /* THEN MOVE                     */ 01004000
@RF00427 CLI   IOPSYUPS(IOPPTR),C' '                               0429 01005000
         BE    @RF00429                                            0429 01006000
*                 CCAUPDSP=IOPSYUPS;/* SYSPRINT DD IN SYS TO CCA     */ 01007000
*                                                                  0430 01008000
         L     @14,@CA00039                                        0430 01009000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0430 01010000
         MVC   CCAUPDSP(8,@14),IOPSYUPS(IOPPTR)                    0430 01011000
*               /*****************************************************/ 01012000
*               /*                                                   */ 01013000
*               /* PROCESS RETURN CODE VALUES                        */ 01014000
*               /*                                                   */ 01015000
*               /*****************************************************/ 01016000
*                                                                  0431 01017000
*               IF IOPSYLKR^=IOPEOLST/* IF RC PRESENT                */ 01018000
*                 THEN              /* THEN MOVE IT                  */ 01019000
@RF00429 CLI   IOPSYLKR(IOPPTR),255                                0431 01020000
         BE    @RF00431                                            0431 01021000
*                 CCARLINK=IOPSYLKR;/* TO CCA                        */ 01022000
         L     @14,@CA00039                                        0432 01023000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0432 01024000
         IC    @02,IOPSYLKR(,IOPPTR)                               0432 01025000
         STC   @02,CCARLINK(,@14)                                  0432 01026000
*               IF IOPSYASR^=IOPEOLST/* IF RC PRESENT                */ 01027000
*                 THEN              /* THEN MOVE IT                  */ 01028000
@RF00431 CLI   IOPSYASR(IOPPTR),255                                0433 01029000
         BE    @RF00433                                            0433 01030000
*                 CCARASM=IOPSYASR; /* TO CCA                        */ 01031000
         L     @14,@CA00039                                        0434 01032000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0434 01033000
         IC    @02,IOPSYASR(,IOPPTR)                               0434 01034000
         STC   @02,CCARASM(,@14)                                   0434 01035000
*               IF IOPSYCPR^=IOPEOLST/* IF RC PRESENT                */ 01036000
*                 THEN              /* THEN MOVE IT                  */ 01037000
@RF00433 CLI   IOPSYCPR(IOPPTR),255                                0435 01038000
         BE    @RF00435                                            0435 01039000
*                 CCARCOPY=IOPSYCPR;/* TO CCA                        */ 01040000
         L     @14,@CA00039                                        0436 01041000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0436 01042000
         IC    @02,IOPSYCPR(,IOPPTR)                               0436 01043000
         STC   @02,CCARCOPY(,@14)                                  0436 01044000
*               IF IOPSYCOR^=IOPEOLST/* IF RC PRESENT                */ 01045000
*                 THEN              /* THEN MOVE IT                  */ 01046000
@RF00435 CLI   IOPSYCOR(IOPPTR),255                                0437 01047000
         BE    @RF00437                                            0437 01048000
*                 CCARCOMP=IOPSYCOR;/* TO CCA                        */ 01049000
         L     @14,@CA00039                                        0438 01050000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0438 01051000
         IC    @02,IOPSYCOR(,IOPPTR)                               0438 01052000
         STC   @02,CCARCOMP(,@14)                                  0438 01053000
*               IF IOPSYZPR^=IOPEOLST/* IF RC PRESENT                */ 01054000
*                 THEN              /* THEN MOVE IT                  */ 01055000
@RF00437 CLI   IOPSYZPR(IOPPTR),255                                0439 01056000
         BE    @RF00439                                            0439 01057000
*                 CCARZAP=IOPSYZPR; /* TO CCA                        */ 01058000
         L     @14,@CA00039                                        0440 01059000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0440 01060000
         IC    @02,IOPSYZPR(,IOPPTR)                               0440 01061000
         STC   @02,CCARZAP(,@14)                                   0440 01062000
*               IF IOPSYSPR^=IOPEOLST/* IF RC PRESENT                */ 01063000
*                 THEN              /* THEN MOVE IT                  */ 01064000
@RF00439 CLI   IOPSYSPR(IOPPTR),255                                0441 01065000
         BE    @RF00441                                            0441 01066000
*                 CCARSUP=IOPSYSPR; /* TO CCA                        */ 01067000
         L     @14,@CA00039                                        0442 01068000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0442 01069000
         IC    @02,IOPSYSPR(,IOPPTR)                               0442 01070000
         STC   @02,CCARSUP(,@14)                                   0442 01071000
*               IF IOPSYUPR^=IOPEOLST/* IF RC PRESENT                */ 01072000
*                 THEN              /* THEN MOVE IT                  */ 01073000
@RF00441 CLI   IOPSYUPR(IOPPTR),255                                0443 01074000
         BE    @RF00443                                            0443 01075000
*                 CCARUPDT=IOPSYUPR;/* TO CCA                        */ 01076000
         L     @14,@CA00039                                        0444 01077000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0444 01078000
         IC    @02,IOPSYUPR(,IOPPTR)                               0444 01079000
         STC   @02,CCARUPDT(,@14)                                  0444 01080000
*               IF IOPSYPLN^=ZERO   /* AND ONE IN SYS ENT            */ 01081000
*                 THEN              /* THEN MOVE                     */ 01082000
@RF00443 LH    @14,IOPSYPLN(,IOPPTR)                               0445 01083000
         LTR   @14,@14                                             0445 01084000
         BZ    @RF00445                                            0445 01085000
*                 CCAPGLEN=IOPSYPLN;/* PAGELEN IN SYS TO CCA         */ 01086000
         L     @02,@CA00039                                        0446 01087000
         STH   @14,CCAPGLEN-HMASMCCA(,@02)                         0446 01088000
*             END;                  /*                               */ 01089000
@RF00445 DS    0H                                                  0448 01090000
*         END;                      /* END PTS DATASET               */ 01091000
@RF00383 DS    0H                                                  0449 01092000
*   RETURN CODE(ZERO);              /*                               */ 01093000
@RF00379 DS    0H                                                  0449 01094000
@RC00367 DS    0H                                                  0449 01095000
@RC00350 SLR   @15,@15                                             0449 01096000
         L     @14,12(,@13)                                        0449 01097000
         LM    @00,@12,20(@13)                                     0449 01098000
         BR    @14                                                 0449 01099000
*   END DS1CCAST;                   /*                               */ 01100000
         EJECT                                                          01101000
*                                                                  0451 01102000
*   /*****************************************************************/ 01103000
*   /*                                                               */ 01104000
*   /* SET DEFALUTS IF NOT CONTAINED IN SYSTEM ENTRY                 */ 01105000
*   /*                                                               */ 01106000
*   /*****************************************************************/ 01107000
*                                                                  0451 01108000
*DS1DFLT:                           /*                               */ 01109000
*   PROCEDURE;                      /*                               */ 01110000
DS1DFLT  STM   @14,@12,12(@13)                                     0451 01111000
*   RFY                                                            0452 01112000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 01113000
*                                                                  0452 01114000
*   /*****************************************************************/ 01115000
*   /*                                                               */ 01116000
*   /* SET DEFAULTS FOR CDS SYSTEM ENTRY                             */ 01117000
*   /*                                                               */ 01118000
*   /*****************************************************************/ 01119000
*                                                                  0453 01120000
*   IF IOPDSID=IOPCDS               /*                               */ 01121000
*     THEN                          /*                               */ 01122000
         CLI   IOPDSID(IOPPTR),2                                   0453 01123000
         BNE   @RF00453                                            0453 01124000
*     DO;                           /*                               */ 01125000
*       IF CCANUCID=BLANK           /*                               */ 01126000
*         THEN                      /*                               */ 01127000
         L     @14,@CA00039                                        0455 01128000
         CLI   CCANUCID-HMASMCCA(@14),C' '                         0455 01129000
         BNE   @RF00455                                            0455 01130000
*         CCANUCID=CHARONE;         /*                               */ 01131000
         MVI   CCANUCID-HMASMCCA(@14),C'1'                         0456 01132000
*     END;                          /*                               */ 01133000
*   ELSE                            /*                               */ 01134000
*                                                                  0458 01135000
*     /***************************************************************/ 01136000
*     /*                                                             */ 01137000
*     /* SET DEFAULTS FOR ACDS SYSTEM ENTRY                          */ 01138000
*     /*                                                             */ 01139000
*     /***************************************************************/ 01140000
*                                                                  0458 01141000
*     IF IOPDSID=IOPACDS            /*                               */ 01142000
*       THEN                        /*                               */ 01143000
         B     @RC00453                                            0458 01144000
@RF00453 CLI   IOPDSID(IOPPTR),12                                  0458 01145000
         BNE   @RF00458                                            0458 01146000
*       DO;                         /*                               */ 01147000
*       END;                        /*                               */ 01148000
*     ELSE                          /*                               */ 01149000
*                                                                  0461 01150000
*       /*************************************************************/ 01151000
*       /*                                                           */ 01152000
*       /* SET DEFALUTS FOR SMPPTS SYSTEM ENTRY DATA                 */ 01153000
*       /*                                                           */ 01154000
*       /*************************************************************/ 01155000
*                                                                  0461 01156000
*       IF IOPDSID=IOPPTS           /*                               */ 01157000
*         THEN                      /*                               */ 01158000
         B     @RC00458                                            0461 01159000
@RF00458 CLI   IOPDSID(IOPPTR),6                                   0461 01160000
         BNE   @RF00461                                            0461 01161000
*         DO;                       /*                               */ 01162000
*           IF CCAPEMAX=ZERO        /* IF PEMAX NOT SET BY THIS TIME */ 01163000
*             THEN                  /* THEN DEFAULT IT TO            */ 01164000
         L     @14,@CA00039                                        0463 01165000
         LH    @02,CCAPEMAX-HMASMCCA(,@14)                         0463 01166000
         LTR   @02,@02                                             0463 01167000
         BNZ   @RF00463                                            0463 01168000
*             CCAPEMAX=PEMAXDFT;    /* DEFAULT VALUE                 */ 01169000
         MVC   CCAPEMAX-HMASMCCA(2,@14),@CH01286                   0464 01170000
*           IF CCALKDNM(1)=BLANK    /* IF NO NAME FROM SYS           */ 01171000
*             THEN                  /* ENTRY THEN                    */ 01172000
@RF00463 L     @14,@CA00039                                        0465 01173000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0465 01174000
         CLI   CCALKDNM(@14),C' '                                  0465 01175000
         BNE   @RF00465                                            0465 01176000
*             CCALKDNM=LKDDFLT;     /* SET UTILITY DEFAULT NAMES     */ 01177000
         MVC   CCALKDNM(8,@14),@CC01298                            0466 01178000
*           IF CCAASMNM(1)=BLANK    /* IF NO NAME FROM SYS           */ 01179000
*             THEN                  /* ENTRY THEN                    */ 01180000
@RF00465 L     @14,@CA00039                                        0467 01181000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0467 01182000
         CLI   CCAASMNM(@14),C' '                                  0467 01183000
         BNE   @RF00467                                            0467 01184000
*             CCAASMNM=ASMDFLT;     /*                               */ 01185000
         MVC   CCAASMNM(8,@14),@CC01300                            0468 01186000
*           IF CCACPYNM(1)=BLANK    /* IF NO NAME FROM SYS           */ 01187000
*             THEN                  /* ENTRY THEN                    */ 01188000
@RF00467 L     @14,@CA00039                                        0469 01189000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0469 01190000
         CLI   CCACPYNM(@14),C' '                                  0469 01191000
         BNE   @RF00469                                            0469 01192000
*             CCACPYNM=CPYDFLT;     /*                               */ 01193000
         MVC   CCACPYNM(8,@14),@CC01302                            0470 01194000
*           IF CCACOMNM(1)=BLANK    /* IF NO NAME FROM SYS           */ 01195000
*             THEN                  /* ENTRY THEN                    */ 01196000
@RF00469 L     @14,@CA00039                                        0471 01197000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0471 01198000
         CLI   CCACOMNM(@14),C' '                                  0471 01199000
         BNE   @RF00471                                            0471 01200000
*             CCACOMNM=COMDFLT;     /*                               */ 01201000
         MVC   CCACOMNM(8,@14),@CC01302                            0472 01202000
*           IF CCAZAPNM(1)=BLANK    /* IF NO NAME FROM SYS           */ 01203000
*             THEN                  /* ENTRY THEN                    */ 01204000
@RF00471 L     @14,@CA00039                                        0473 01205000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0473 01206000
         CLI   CCAZAPNM(@14),C' '                                  0473 01207000
         BNE   @RF00473                                            0473 01208000
*             CCAZAPNM=ZAPDFLT;     /*                               */ 01209000
         MVC   CCAZAPNM(8,@14),@CC01305                            0474 01210000
*           IF CCASUPNM(1)=BLANK    /* IF NO NAME FROM SYS           */ 01211000
*             THEN                  /* ENTRY THEN                    */ 01212000
@RF00473 L     @14,@CA00039                                        0475 01213000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0475 01214000
         CLI   CCASUPNM(@14),C' '                                  0475 01215000
         BNE   @RF00475                                            0475 01216000
*             CCASUPNM=SUPDFLT;     /*                               */ 01217000
         MVC   CCASUPNM(8,@14),@CC01307                            0476 01218000
*           IF CCAUPDNM(1)=BLANK    /* IF NO NAME FROM SYS           */ 01219000
*             THEN                  /* ENTRY THEN                    */ 01220000
@RF00475 L     @14,@CA00039                                        0477 01221000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0477 01222000
         CLI   CCAUPDNM(@14),C' '                                  0477 01223000
         BNE   @RF00477                                            0477 01224000
*             CCAUPDNM=UPDDFLT;     /*                               */ 01225000
         MVC   CCAUPDNM(8,@14),@CC01309                            0478 01226000
*           IF CCALKDPM(1)=BLANK    /* IF NO NAME FROM SYS           */ 01227000
*             THEN                  /* ENTRY THEN                    */ 01228000
@RF00477 L     @14,@CA00039                                        0479 01229000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0479 01230000
         CLI   CCALKDPM(@14),C' '                                  0479 01231000
         BNE   @RF00479                                            0479 01232000
*             CCALKDPM=LKDDFLTP;    /* SET UTILITY DEFAULT NAMES     */ 01233000
         MVC   CCALKDPM(100,@14),LKDDFLTP                          0480 01234000
*           IF CCAASMPM(1)=BLANK    /* IF NO NAME FROM SYS           */ 01235000
*             THEN                  /* ENTRY THEN                    */ 01236000
@RF00479 L     @14,@CA00039                                        0481 01237000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0481 01238000
         CLI   CCAASMPM(@14),C' '                                  0481 01239000
         BNE   @RF00481                                            0481 01240000
*             CCAASMPM=ASMDFLTP;    /*                               */ 01241000
         MVC   CCAASMPM(100,@14),ASMDFLTP                          0482 01242000
*           IF CCACPYPM(1)=BLANK    /* IF NO NAME FROM SYS           */ 01243000
*             THEN                  /* ENTRY THEN                    */ 01244000
@RF00481 L     @14,@CA00039                                        0483 01245000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0483 01246000
         CLI   CCACPYPM(@14),C' '                                  0483 01247000
         BNE   @RF00483                                            0483 01248000
*             CCACPYPM=CPYDFLTP;    /*                               */ 01249000
         MVC   CCACPYPM(100,@14),CPYDFLTP                          0484 01250000
*           IF CCACOMPM(1)=BLANK    /* IF NO NAME FROM SYS           */ 01251000
*             THEN                  /* ENTRY THEN                    */ 01252000
@RF00483 L     @14,@CA00039                                        0485 01253000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0485 01254000
         CLI   CCACOMPM(@14),C' '                                  0485 01255000
         BNE   @RF00485                                            0485 01256000
*             CCACOMPM=COMDFLTP;    /*                               */ 01257000
         MVC   CCACOMPM(100,@14),COMDFLTP                          0486 01258000
*           IF CCAZAPPM(1)=BLANK    /* IF NO NAME FROM SYS           */ 01259000
*             THEN                  /* ENTRY THEN                    */ 01260000
@RF00485 L     @14,@CA00039                                        0487 01261000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0487 01262000
         CLI   CCAZAPPM(@14),C' '                                  0487 01263000
         BNE   @RF00487                                            0487 01264000
*             CCAZAPPM=ZAPDFLTP;    /*                               */ 01265000
         MVC   CCAZAPPM(100,@14),ZAPDFLTP                          0488 01266000
*           IF CCASUPPM(1)=BLANK    /* IF NO NAME FROM SYS           */ 01267000
*             THEN                  /* ENTRY THEN                    */ 01268000
@RF00487 L     @14,@CA00039                                        0489 01269000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0489 01270000
         CLI   CCASUPPM(@14),C' '                                  0489 01271000
         BNE   @RF00489                                            0489 01272000
*             CCASUPPM=SUPDFLTP;    /*                               */ 01273000
         MVC   CCASUPPM(100,@14),SUPDFLTP                          0490 01274000
*           IF CCAUPDPM(1)=BLANK    /* IF NO NAME FROM SYS           */ 01275000
*             THEN                  /* ENTRY THEN                    */ 01276000
@RF00489 L     @14,@CA00039                                        0491 01277000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0491 01278000
         CLI   CCAUPDPM(@14),C' '                                  0491 01279000
         BNE   @RF00491                                            0491 01280000
*             CCAUPDPM=UPDDFLTP;    /*                               */ 01281000
         MVC   CCAUPDPM(100,@14),UPDDFLTP                          0492 01282000
*           IF CCALKDSP(1)=BLANK    /* IF NO NAME FROM SYS           */ 01283000
*             THEN                  /* ENTRY THEN                    */ 01284000
@RF00491 L     @14,@CA00039                                        0493 01285000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0493 01286000
         CLI   CCALKDSP(@14),C' '                                  0493 01287000
         BNE   @RF00493                                            0493 01288000
*             CCALKDSP=SYSPRINT;    /* SET UTILITY DEFAULT SYSPRINT  */ 01289000
         MVC   CCALKDSP(8,@14),@CC01289                            0494 01290000
*           IF CCAASMSP(1)=BLANK    /* IF NO NAME FROM SYS           */ 01291000
*             THEN                  /* ENTRY THEN                    */ 01292000
@RF00493 L     @14,@CA00039                                        0495 01293000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0495 01294000
         CLI   CCAASMSP(@14),C' '                                  0495 01295000
         BNE   @RF00495                                            0495 01296000
*             CCAASMSP=SYSPRINT;    /*                               */ 01297000
         MVC   CCAASMSP(8,@14),@CC01289                            0496 01298000
*           IF CCACPYSP(1)=BLANK    /* IF NO NAME FROM SYS           */ 01299000
*             THEN                  /* ENTRY THEN                    */ 01300000
@RF00495 L     @14,@CA00039                                        0497 01301000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0497 01302000
         CLI   CCACPYSP(@14),C' '                                  0497 01303000
         BNE   @RF00497                                            0497 01304000
*             CCACPYSP=SYSPRINT;    /*                               */ 01305000
         MVC   CCACPYSP(8,@14),@CC01289                            0498 01306000
*           IF CCACOMSP(1)=BLANK    /* IF NO NAME FROM SYS           */ 01307000
*             THEN                  /* ENTRY THEN                    */ 01308000
@RF00497 L     @14,@CA00039                                        0499 01309000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0499 01310000
         CLI   CCACOMSP(@14),C' '                                  0499 01311000
         BNE   @RF00499                                            0499 01312000
*             CCACOMSP=SYSPRINT;    /*                               */ 01313000
         MVC   CCACOMSP(8,@14),@CC01289                            0500 01314000
*           IF CCAZAPSP(1)=BLANK    /* IF NO NAME FROM SYS           */ 01315000
*             THEN                  /* ENTRY THEN                    */ 01316000
@RF00499 L     @14,@CA00039                                        0501 01317000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0501 01318000
         CLI   CCAZAPSP(@14),C' '                                  0501 01319000
         BNE   @RF00501                                            0501 01320000
*             CCAZAPSP=SYSPRINT;    /*                               */ 01321000
         MVC   CCAZAPSP(8,@14),@CC01289                            0502 01322000
*           IF CCASUPSP(1)=BLANK    /* IF NO NAME FROM SYS           */ 01323000
*             THEN                  /* ENTRY THEN                    */ 01324000
@RF00501 L     @14,@CA00039                                        0503 01325000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0503 01326000
         CLI   CCASUPSP(@14),C' '                                  0503 01327000
         BNE   @RF00503                                            0503 01328000
*             CCASUPSP=SYSPRINT;    /*                               */ 01329000
         MVC   CCASUPSP(8,@14),@CC01289                            0504 01330000
*           IF CCAUPDSP(1)=BLANK    /* IF NO NAME FROM SYS           */ 01331000
*             THEN                  /* ENTRY THEN                    */ 01332000
@RF00503 L     @14,@CA00039                                        0505 01333000
         L     @14,CCABLDLP-HMASMCCA(,@14)                         0505 01334000
         CLI   CCAUPDSP(@14),C' '                                  0505 01335000
         BNE   @RF00505                                            0505 01336000
*             CCAUPDSP=SYSPRINT;    /*                               */ 01337000
         MVC   CCAUPDSP(8,@14),@CC01289                            0506 01338000
*         END;                      /*                               */ 01339000
*                                                                  0507 01340000
@RF00505 DS    0H                                                  0508 01341000
*   /*****************************************************************/ 01342000
*   /*                                                               */ 01343000
*   /* RETURN                                                        */ 01344000
*   /*                                                               */ 01345000
*   /*****************************************************************/ 01346000
*                                                                  0508 01347000
*   RETURN CODE(ZERO);              /*                               */ 01348000
@RF00461 DS    0H                                                  0508 01349000
@RC00458 DS    0H                                                  0508 01350000
@RC00453 SLR   @15,@15                                             0508 01351000
         L     @14,12(,@13)                                        0508 01352000
         LM    @00,@12,20(@13)                                     0508 01353000
         BR    @14                                                 0508 01354000
*   END DS1DFLT;                    /*                               */ 01355000
         EJECT                                                          01356000
*                                                                  0510 01357000
*   /*****************************************************************/ 01358000
*   /*                                                               */ 01359000
*   /* ROUTINE CALLED TO FREE OLD IOP AND GETMAIN NEW ONE BASED ON   */ 01360000
*   /* NEW CCAPEMAX VALUE                                            */ 01361000
*   /*                                                               */ 01362000
*   /*****************************************************************/ 01363000
*                                                                  0510 01364000
*DS1GMIOP:                          /*                               */ 01365000
*   PROCEDURE;                      /*                               */ 01366000
DS1GMIOP STM   @14,@02,@SA00007                                    0510 01367000
         STM   @04,@12,@SA00007+20                                 0510 01368000
*   RFY                             /*                               */ 01369000
*     HMASMIOP BASED(IOPPTR);       /*                               */ 01370000
*   SAVIOP=HMASMIOP;                /* SAVE CURRENT IOP              */ 01371000
         MVC   SAVIOP(68),HMASMIOP(IOPPTR)                         0512 01372000
*   IF CCAIOPTR^=ZERO               /* IF OLD IOP EXISTS             */ 01373000
*     THEN                          /*                               */ 01374000
         L     @14,@CA00039                                        0513 01375000
         L     @14,CCAIOPTR-HMASMCCA(,@14)                         0513 01376000
         LTR   @14,@14                                             0513 01377000
         BZ    @RF00513                                            0513 01378000
*     DO;                           /*                               */ 01379000
*       SPLFUNCT=SPLFMIOP;          /* FREE IT                       */ 01380000
         MVI   SPLFUNCT,X'04'                                      0515 01381000
*       SPLPMAD=CCAIOPTR;           /*                               */ 01382000
         ST    @14,SPLPMAD                                         0516 01383000
*       CALL HMASMSUB(HMASMSPL);    /*                               */ 01384000
         L     @15,@CV01268                                        0517 01385000
         LA    @01,@AL00517                                        0517 01386000
         BALR  @14,@15                                             0517 01387000
*     END;                          /*                               */ 01388000
*   SPLFUNCT=SPLGMIOP;              /* GETMAIN NEW ONE               */ 01389000
@RF00513 MVI   SPLFUNCT,X'03'                                      0519 01390000
*   CALL HMASMSUB(HMASMSPL);        /*                               */ 01391000
         L     @15,@CV01268                                        0520 01392000
         LA    @01,@AL00520                                        0520 01393000
         BALR  @14,@15                                             0520 01394000
*   RFY                                                            0521 01395000
*     RTNCODE RSTD;                 /*                               */ 01396000
*   IF RTNCODE=SPLGOOD              /* IF NEW IOP GETMAINED          */ 01397000
*     THEN                          /* THEN                          */ 01398000
         LTR   RTNCODE,RTNCODE                                     0522 01399000
         BNZ   @RF00522                                            0522 01400000
*     DO;                           /*                               */ 01401000
*       CCAIOPTR=SPLPMAD;           /* PUT NEW ADDR IN IOP           */ 01402000
         L     @14,@CA00039                                        0524 01403000
         L     @02,SPLPMAD                                         0524 01404000
         ST    @02,CCAIOPTR-HMASMCCA(,@14)                         0524 01405000
*       IOPPTR=CCAIOPTR;            /* PICK UP NEW IOP ADDRESS       */ 01406000
         LR    IOPPTR,@02                                          0525 01407000
*       HMASMIOP=SAVIOP;            /* RESTORE IOP WITH ORIGINAL     */ 01408000
         MVC   HMASMIOP(68,IOPPTR),SAVIOP                          0526 01409000
*     END;                          /* FIXED AREA DATA               */ 01410000
*   ELSE                            /* ELSE                          */ 01411000
*     CCAIOPTR=ZERO;                /* INDICATE NO IOP               */ 01412000
         B     @RC00522                                            0528 01413000
@RF00522 L     @14,@CA00039                                        0528 01414000
         SLR   @02,@02                                             0528 01415000
         ST    @02,CCAIOPTR-HMASMCCA(,@14)                         0528 01416000
*   RETURN CODE(RTNCODE);           /* RETURN WITH SUB RC            */ 01417000
@RC00522 L     @14,@SA00007                                        0529 01418000
         LM    @00,@02,@SA00007+8                                  0529 01419000
         LM    @04,@12,@SA00007+20                                 0529 01420000
         BR    @14                                                 0529 01421000
*   RFY                                                            0530 01422000
*     RTNCODE UNRSTD;               /*                               */ 01423000
*   END DS1GMIOP;                   /*                               */ 01424000
*   END HMASMDS1                                                   0532 01425000
*                                                                  0532 01426000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01427000
*/*%INCLUDE SYSLIB  (HMASMCCA)                                       */ 01428000
*/*%INCLUDE SYSLIB  (HMASMIOP)                                       */ 01429000
*/*%INCLUDE SYSLIB  (HMASMMGP)                                       */ 01430000
*/*%INCLUDE SYSLIB  (HMASMSPL)                                       */ 01431000
*                                                                  0532 01432000
*       ;                                                          0532 01433000
@DATA    DS    0H                                                       01434000
@CH00131 DC    H'5'                                                     01435000
@CH00807 DC    H'60'                                                    01436000
@CH01284 DC    H'120'                                                   01437000
@CH01062 DC    H'167'                                                   01438000
@CH01064 DC    H'168'                                                   01439000
@CH01286 DC    H'500'                                                   01440000
         DS    0F                                                       01441000
@AL00294 EQU   *                       LIST WITH   1 ARGUMENT(S)        01442000
@AL00325 EQU   *                       LIST WITH   1 ARGUMENT(S)        01443000
@AL00336 DC    A(HMASMMGP)             LIST WITH   1 ARGUMENT(S)        01444000
@AL00517 EQU   *                       LIST WITH   1 ARGUMENT(S)        01445000
@AL00520 DC    A(HMASMSPL)             LIST WITH   1 ARGUMENT(S)        01446000
         DS    0F                                                       01447000
@SA00001 DS    18F                                                      01448000
@PC00001 DS    2F                                                       01449000
@SA00003 DS    15F                                                      01450000
@SA00004 DS    0F                                                       01451000
@SA00007 DS    0F                                                       01452000
         DS    15F                                                      01453000
@AL00001 DS    1A                                                       01454000
         DS    0F                                                       01455000
@CF00253 DC    F'0'                                                     01456000
@CA00039 DC    A(HMASMCCA)                                              01457000
@CV01265 DC    V(HMASMIO)                                               01458000
@CV01266 DC    V(HMASMBDL)                                              01459000
@CV01267 DC    V(HMASMMSG)                                              01460000
@CV01268 DC    V(HMASMSUB)                                              01461000
         DS    0D                                                       01462000
@CC01289 DC    C'SYSPRINT'                                              01463000
@CC01298 DC    C'IEWL    '                                              01464000
@CC01300 DC    C'ASMBLR  '                                              01465000
@CC01302 DC    C'IEBCOPY '                                              01466000
@CC01305 DC    C'IMASPZAP'                                              01467000
@CC01307 DC    C'IEHIOSUP'                                              01468000
@CC01309 DC    C'IEBUPDTE'                                              01469000
@CC01273 DC    C'HIGHER'                                                01470000
@CC01275 DC    C'LOWER '                                                01471000
HMASMMGP DS    CL24                                                     01472000
         ORG   HMASMMGP                                                 01473000
MGPFIXED DS    CL12                                                     01474000
         ORG   MGPFIXED                                                 01475000
MGPCLEAR DS    CL6                                                      01476000
         ORG   MGPCLEAR                                                 01477000
MGPMGNO1 DS    FL2                                                      01478000
MGPMGNO2 DS    FL2                                                      01479000
MGPMGNO3 DS    FL2                                                      01480000
         ORG   MGPFIXED+6                                               01481000
MGPFLAGS DS    BL2                                                      01482000
         ORG   MGPFLAGS                                                 01483000
MGPPRINT DS    BL1                                                      01484000
MGPLIST  EQU   MGPFLAGS+0                                               01485000
MGPRPT   EQU   MGPFLAGS+0                                               01486000
MGPHLDS  EQU   MGPFLAGS+0                                               01487000
MGPWTOR  EQU   MGPFLAGS+0                                               01488000
MGPWTO   EQU   MGPFLAGS+0                                               01489000
MGPWTP   EQU   MGPFLAGS+0                                               01490000
@NM00171 EQU   MGPFLAGS+0                                               01491000
         ORG   MGPFIXED+8                                               01492000
MGPTYPE  DS    FL1                                                      01493000
@NM00172 DS    CL3                                                      01494000
         ORG   HMASMMGP+12                                              01495000
MGPVAR   DS    CL12                                                     01496000
         ORG   MGPVAR                                                   01497000
MGPVARPT DS    3A                                                       01498000
         ORG   HMASMMGP+24                                              01499000
HMASMSPL DS    CL5                                                      01500000
         ORG   HMASMSPL                                                 01501000
SPLPMAD  DS    AL4                                                      01502000
SPLFUNCT DS    FL1                                                      01503000
         ORG   HMASMSPL+5                                               01504000
SAVIOP   DS    CL68                                                     01505000
         DS    CL1                                                      01506000
PATCHDS1 DS    CL80                                                     01507000
         ORG   PATCHDS1                                                 01508000
@NM00173 DC    80X'FF'                                                  01509000
         ORG   PATCHDS1+80                                              01510000
LKDDFLTP DC    CL100'NCAL,LIST,LET,XREF                            '    01511000
ASMDFLTP DC    CL100'XREF,NOLOAD,DECK                              '    01512000
CPYDFLTP DC    CL100'                                              '    01513000
COMDFLTP DC    CL100'                                              '    01514000
ZAPDFLTP DC    CL100'                                              '    01515000
SUPDFLTP DC    CL100'                                              '    01516000
UPDDFLTP DC    CL100'                                              '    01517000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01518000
@01      EQU   01                                                       01519000
@02      EQU   02                                                       01520000
@03      EQU   03                                                       01521000
@04      EQU   04                                                       01522000
@05      EQU   05                                                       01523000
@06      EQU   06                                                       01524000
@07      EQU   07                                                       01525000
@08      EQU   08                                                       01526000
@09      EQU   09                                                       01527000
@10      EQU   10                                                       01528000
@11      EQU   11                                                       01529000
@12      EQU   12                                                       01530000
@13      EQU   13                                                       01531000
@14      EQU   14                                                       01532000
@15      EQU   15                                                       01533000
SAVRETRN EQU   @06                                                      01534000
SAVFUNCT EQU   @05                                                      01535000
SLRC     EQU   @04                                                      01536000
LCRTNCD  EQU   @04                                                      01537000
OLDPEMAX EQU   @05                                                      01538000
DS1RTNCD EQU   @04                                                      01539000
IOPPTR   EQU   @03                                                      01540000
CCAPTR   EQU   @11                                                      01541000
RTNCODE  EQU   @15                                                      01542000
RTNREG   EQU   @14                                                      01543000
         EXTRN HMASMCCA                                                 01544000
CCADSIDA EQU   0                                                        01545000
CCABLDLA EQU   0                                                        01546000
@NM00025 EQU   CCABLDLA                                                 01547000
CCABLDLL EQU   0                                                        01548000
@NM00027 EQU   CCABLDLL                                                 01549000
CCALKDNM EQU   @NM00027                                                 01550000
CCALKDSP EQU   @NM00027+12                                              01551000
CCALKDRC EQU   @NM00027+20                                              01552000
CCARLINK EQU   CCALKDRC                                                 01553000
CCALKDPM EQU   @NM00027+24                                              01554000
@NM00029 EQU   CCABLDLL+124                                             01555000
CCAASMNM EQU   @NM00029                                                 01556000
CCAASMSP EQU   @NM00029+12                                              01557000
CCAASMRC EQU   @NM00029+20                                              01558000
CCARASM  EQU   CCAASMRC                                                 01559000
CCAASMPM EQU   @NM00029+24                                              01560000
@NM00031 EQU   CCABLDLL+248                                             01561000
CCACPYNM EQU   @NM00031                                                 01562000
CCACPYSP EQU   @NM00031+12                                              01563000
CCACPYRC EQU   @NM00031+20                                              01564000
CCARCOPY EQU   CCACPYRC                                                 01565000
CCACPYPM EQU   @NM00031+24                                              01566000
@NM00033 EQU   CCABLDLL+372                                             01567000
CCACOMNM EQU   @NM00033                                                 01568000
CCACOMSP EQU   @NM00033+12                                              01569000
CCACOMRC EQU   @NM00033+20                                              01570000
CCARCOMP EQU   CCACOMRC                                                 01571000
CCACOMPM EQU   @NM00033+24                                              01572000
@NM00035 EQU   CCABLDLL+496                                             01573000
CCAZAPNM EQU   @NM00035                                                 01574000
CCAZAPSP EQU   @NM00035+12                                              01575000
CCAZAPRC EQU   @NM00035+20                                              01576000
CCARZAP  EQU   CCAZAPRC                                                 01577000
CCAZAPPM EQU   @NM00035+24                                              01578000
@NM00037 EQU   CCABLDLL+620                                             01579000
CCASUPNM EQU   @NM00037                                                 01580000
CCASUPSP EQU   @NM00037+12                                              01581000
CCASUPRC EQU   @NM00037+20                                              01582000
CCARSUP  EQU   CCASUPRC                                                 01583000
CCASUPPM EQU   @NM00037+24                                              01584000
@NM00039 EQU   CCABLDLL+744                                             01585000
CCAUPDNM EQU   @NM00039                                                 01586000
CCAUPDSP EQU   @NM00039+12                                              01587000
CCAUPDRC EQU   @NM00039+20                                              01588000
CCARUPDT EQU   CCAUPDRC                                                 01589000
CCAUPDPM EQU   @NM00039+24                                              01590000
CCABLDLM EQU   0                                                        01591000
CCABELMT EQU   CCABLDLM+4                                               01592000
CCABMPOS EQU   CCABELMT                                                 01593000
HMASMIOP EQU   0                                                        01594000
IOPDSID  EQU   HMASMIOP                                                 01595000
IOPFUNCT EQU   HMASMIOP+1                                               01596000
IOPRETRN EQU   HMASMIOP+2                                               01597000
IOPTYPE  EQU   HMASMIOP+3                                               01598000
IOPNAME  EQU   HMASMIOP+4                                               01599000
@NM00043 EQU   HMASMIOP+12                                              01600000
@NM00044 EQU   @NM00043                                                 01601000
IOPDDNAM EQU   HMASMIOP+24                                              01602000
IOPBUFAD EQU   HMASMIOP+52                                              01603000
IOPDRMAP EQU   HMASMIOP+56                                              01604000
IOPINAME EQU   IOPDRMAP                                                 01605000
IOPINAM  EQU   IOPINAME                                                 01606000
IOPITYP  EQU   IOPINAM                                                  01607000
IOPUSERL EQU   IOPDRMAP+11                                              01608000
IOPEND   EQU   IOPDRMAP+12                                              01609000
IOPLMCTL EQU   0                                                        01610000
IOPQSMIF EQU   0                                                        01611000
@NM00154 EQU   IOPQSMIF                                                 01612000
IOPQSMLS EQU   IOPQSMIF+8                                               01613000
IOPQSMNM EQU   IOPQSMLS                                                 01614000
IOPBS02  EQU   0                                                        01615000
IOPBS04  EQU   0                                                        01616000
IOPBAPF  EQU   IOPBS04                                                  01617000
SPLPPACK EQU   0                                                        01618000
SPLPUNPK EQU   0                                                        01619000
SPLPDSN  EQU   0                                                        01620000
SPLODSN  EQU   SPLPDSN                                                  01621000
CCATYPEA EQU   0                                                        01622000
IOPBS01  EQU   0                                                        01623000
IOPBS03  EQU   0                                                        01624000
CCAFBUFR EQU   HMASMCCA+4                                               01625000
CCADSAD  EQU   CCAFBUFR+124                                             01626000
CCATPAD  EQU   CCAFBUFR+128                                             01627000
CCAFLAG7 EQU   CCAFBUFR+132                                             01628000
CCAFIOP  EQU   HMASMCCA+140                                             01629000
CCAIOPTR EQU   CCAFIOP                                                  01630000
CCAFSYS  EQU   HMASMCCA+148                                             01631000
CCAIOPCS EQU   CCAFSYS                                                  01632000
CCAIOPAS EQU   CCAFSYS+4                                                01633000
CCAPGLEN EQU   CCAFSYS+8                                                01634000
CCAPEMAX EQU   CCAFSYS+10                                               01635000
CCASREL  EQU   CCAFSYS+12                                               01636000
CCACSREL EQU   CCASREL                                                  01637000
CCAASREL EQU   CCAFSYS+16                                               01638000
CCANUCID EQU   CCAFSYS+20                                               01639000
CCAFLAGA EQU   CCAFSYS+21                                               01640000
CCACSYSF EQU   CCAFLAGA                                                 01641000
CCAASYSF EQU   CCAFLAGA                                                 01642000
CCAPSYSF EQU   CCAFLAGA                                                 01643000
CCALNLEN EQU   CCAFSYS+22                                               01644000
CCACDSID EQU   CCAFSYS+24                                               01645000
CCAACDID EQU   CCAFSYS+32                                               01646000
CCAFSTA  EQU   HMASMCCA+188                                             01647000
CCAFICT  EQU   HMASMCCA+192                                             01648000
CCAFPGM  EQU   HMASMCCA+208                                             01649000
CCABLDLP EQU   CCAFPGM                                                  01650000
CCADBLDL EQU   CCAFPGM+4                                                01651000
CCAFGTP  EQU   HMASMCCA+224                                             01652000
CCASEGTP EQU   CCAFGTP                                                  01653000
@NM00009 EQU   HMASMCCA+244                                             01654000
CCAFFUNC EQU   HMASMCCA+264                                             01655000
CCAFLAG1 EQU   CCAFFUNC+8                                               01656000
CCAUPDU  EQU   CCAFLAG1                                                 01657000
CCAFLAG2 EQU   CCAFFUNC+11                                              01658000
CCAFPROC EQU   HMASMCCA+276                                             01659000
CCAFLAG3 EQU   CCAFPROC                                                 01660000
CCAFDIS  EQU   HMASMCCA+278                                             01661000
CCAFLAG4 EQU   CCAFDIS                                                  01662000
CCAFLAG5 EQU   CCAFDIS+1                                                01663000
CCAFLAG6 EQU   CCAFDIS+2                                                01664000
CCAFCNV  EQU   HMASMCCA+281                                             01665000
CCAFLAG8 EQU   CCAFCNV                                                  01666000
CCACDSC  EQU   CCAFLAG8                                                 01667000
CCAACDSC EQU   CCAFLAG8                                                 01668000
CCAFCTL  EQU   HMASMCCA+282                                             01669000
CCAFLAG9 EQU   CCAFCTL                                                  01670000
CCAPTSNP EQU   CCAFLAG9                                                 01671000
CCAMTSNP EQU   CCAFLAG9                                                 01672000
CCASTSNP EQU   CCAFLAG9                                                 01673000
CCAPTSNJ EQU   CCAFLAG9                                                 01674000
CCAFDSNG EQU   HMASMCCA+298                                             01675000
CCAFLAGB EQU   CCAFDSNG                                                 01676000
DS1IOP   EQU   0                                                        01677000
PRIMED   EQU   0                                                        01678000
IOPUDATA EQU   IOPEND                                                   01679000
IOPINAM3 EQU   IOPINAME                                                 01680000
@NM00050 EQU   IOPINAM3                                                 01681000
IOPSTCMP EQU   IOPUDATA                                                 01682000
IOPDYNDT EQU   IOPUDATA                                                 01683000
IOPSPACE EQU   IOPDYNDT+44                                              01684000
IOPDTYPE EQU   IOPDYNDT+50                                              01685000
IOPNTMAX EQU   IOPDRMAP                                                 01686000
IOPNTMAP EQU   IOPDRMAP                                                 01687000
IOPCDMAP EQU   IOPNTMAP                                                 01688000
IOPPTMAP EQU   IOPCDMAP                                                 01689000
IOPSCMAP EQU   IOPPTMAP                                                 01690000
IOPDIRCT EQU   IOPSCMAP+12                                              01691000
IOPCDMAX EQU   IOPDIRCT                                                 01692000
IOPCQMAP EQU   IOPDRMAP                                                 01693000
@NM00061 EQU   IOPUDATA                                                 01694000
@NM00062 EQU   IOPUDATA                                                 01695000
IOPASMNT EQU   IOPUDATA                                                 01696000
IOPASMDR EQU   IOPASMNT                                                 01697000
IOPABUNT EQU   IOPASMDR+1                                               01698000
IOPLMDNT EQU   IOPUDATA                                                 01699000
IOPLMDDR EQU   IOPLMDNT                                                 01700000
IOPLMLEP EQU   IOPLMDDR+1                                               01701000
IOPLMDF1 EQU   IOPLMLEP                                                 01702000
IOPFLGS2 EQU   IOPLMDF1                                                 01703000
IOPLMDF2 EQU   IOPLMLEP+1                                               01704000
IOPLMDF3 EQU   IOPLMLEP+2                                               01705000
IOPLMDF4 EQU   IOPLMLEP+3                                               01706000
IOPLMDF5 EQU   IOPLMDDR+5                                               01707000
IOPFLGS3 EQU   IOPLMDF5                                                 01708000
IOPLMDFX EQU   IOPLMDNT+24                                              01709000
@NM00071 EQU   IOPLMDFX                                                 01710000
IOPLNTRY EQU   IOPLMDFX+8                                               01711000
IOPLSYS  EQU   IOPLNTRY                                                 01712000
IOPSYSLB EQU   IOPLSYS                                                  01713000
IOPMACNT EQU   IOPUDATA                                                 01714000
IOPMACDR EQU   IOPMACNT                                                 01715000
IOPRMIDE EQU   IOPMACDR+1                                               01716000
IOPRMST  EQU   IOPRMIDE+7                                               01717000
IOPFMIDE EQU   IOPMACDR+9                                               01718000
IOPMACFX EQU   IOPMACNT+24                                              01719000
IOPBUNT  EQU   IOPMACFX                                                 01720000
IOPMCEND EQU   IOPMACNT+104                                             01721000
IOPMACVR EQU   IOPMCEND                                                 01722000
IOPMCENT EQU   IOPMACVR                                                 01723000
IOPMCDTA EQU   IOPMCENT                                                 01724000
IOPMCASM EQU   IOPMCDTA                                                 01725000
IOPMACID EQU   IOPMCASM                                                 01726000
IOPMACST EQU   IOPMCASM+7                                               01727000
IOPMCIND EQU   IOPMCENT+8                                               01728000
IOPEOFNT EQU   IOPUDATA                                                 01729000
IOPSRCNT EQU   IOPUDATA                                                 01730000
IOPSRCDR EQU   IOPSRCNT                                                 01731000
@NM00082 EQU   IOPSRCDR+1                                               01732000
@NM00084 EQU   @NM00082+7                                               01733000
@NM00088 EQU   IOPSRCDR+9                                               01734000
IOPSRCFX EQU   IOPSRCNT+24                                              01735000
@NM00092 EQU   IOPSRCFX                                                 01736000
IOPSREND EQU   IOPSRCNT+104                                             01737000
IOPSRCVR EQU   IOPSREND                                                 01738000
IOPSNTRY EQU   IOPSRCVR                                                 01739000
IOPSRDTA EQU   IOPSNTRY                                                 01740000
IOPSRCID EQU   IOPSRDTA                                                 01741000
IOPSRCST EQU   IOPSRDTA+7                                               01742000
IOPMODNT EQU   IOPUDATA                                                 01743000
IOPMODDR EQU   IOPMODNT                                                 01744000
@NM00098 EQU   IOPMODDR+1                                               01745000
@NM00100 EQU   @NM00098+7                                               01746000
@NM00104 EQU   IOPMODDR+9                                               01747000
IOPMODFX EQU   IOPMODNT+24                                              01748000
@NM00108 EQU   IOPMODFX                                                 01749000
IOPMDLEP EQU   IOPMODFX+8                                               01750000
IOPMODF1 EQU   IOPMDLEP                                                 01751000
IOPMODF2 EQU   IOPMDLEP+1                                               01752000
IOPMODF3 EQU   IOPMDLEP+2                                               01753000
IOPMODF4 EQU   IOPMDLEP+3                                               01754000
IOPMDEND EQU   IOPMODNT+104                                             01755000
IOPMODVR EQU   IOPMDEND                                                 01756000
IOPMNTRY EQU   IOPMODVR                                                 01757000
IOPMDDTA EQU   IOPMNTRY                                                 01758000
IOPLMODS EQU   IOPMDDTA                                                 01759000
IOPMODID EQU   IOPLMODS                                                 01760000
IOPMODST EQU   IOPLMODS+7                                               01761000
IOPDLBNT EQU   IOPUDATA                                                 01762000
IOPDLBDR EQU   IOPDLBNT                                                 01763000
IOPDLBFX EQU   IOPDLBNT+24                                              01764000
@NM00119 EQU   IOPDLBFX                                                 01765000
IOPDLEND EQU   IOPDLBNT+104                                             01766000
IOPDLBVR EQU   IOPDLEND                                                 01767000
IOPDNTRY EQU   IOPDLBVR                                                 01768000
IOPDSYS  EQU   IOPDNTRY                                                 01769000
IOPSYSNT EQU   IOPUDATA                                                 01770000
IOPSYSDR EQU   IOPSYSNT                                                 01771000
IOPSCNVL EQU   IOPSYSDR+1                                               01772000
IOPPEMAX EQU   IOPSYSDR+2                                               01773000
IOPSYSF1 EQU   IOPSYSDR+4                                               01774000
IOPFLGS7 EQU   IOPSYSF1                                                 01775000
IOPMTSNP EQU   IOPFLGS7                                                 01776000
IOPSTSNP EQU   IOPFLGS7                                                 01777000
IOPSYDL  EQU   IOPFLGS7                                                 01778000
IOPSYNG  EQU   IOPFLGS7                                                 01779000
IOPSYSFX EQU   IOPSYSNT+24                                              01780000
@NM00126 EQU   IOPSYSFX                                                 01781000
IOPSREL  EQU   IOPSYSFX+8                                               01782000
IOPNUCID EQU   IOPSYSFX+12                                              01783000
IOPSYSID EQU   IOPSYSFX+13                                              01784000
IOPSYEND EQU   IOPSYSNT+184                                             01785000
IOPSYSVR EQU   IOPSYEND                                                 01786000
IOPSYSTR EQU   IOPSYSVR                                                 01787000
IOPSYNTR EQU   IOPSYSTR                                                 01788000
IOPPTFNT EQU   IOPUDATA                                                 01789000
IOPPTFDR EQU   IOPPTFNT                                                 01790000
IOPPSTAT EQU   IOPPTFDR+2                                               01791000
IOPPTFF1 EQU   IOPPSTAT                                                 01792000
IOPFLGS5 EQU   IOPPTFF1                                                 01793000
IOPPTFF2 EQU   IOPPSTAT+1                                               01794000
IOPPTFF3 EQU   IOPPSTAT+3                                               01795000
IOPPTFFX EQU   IOPPTFNT+24                                              01796000
@NM00135 EQU   IOPPTFFX                                                 01797000
@NM00136 EQU   @NM00135                                                 01798000
IOPPDTES EQU   IOPPTFFX+41                                              01799000
@NM00139 EQU   IOPPDTES                                                 01800000
IOPPTPFX EQU   IOPPDTES+6                                               01801000
IOPDATES EQU   IOPPTPFX                                                 01802000
IOPPTEND EQU   IOPPTFNT+104                                             01803000
IOPPTFVR EQU   IOPPTEND                                                 01804000
IOPPNTRY EQU   IOPPTFVR                                                 01805000
IOPPMODS EQU   IOPPNTRY                                                 01806000
IOPENTNT EQU   IOPUDATA+104                                             01807000
IOPSRLNT EQU   IOPUDATA+104                                             01808000
IOPPRENT EQU   IOPUDATA+104                                             01809000
IOPNPRNT EQU   IOPUDATA+104                                             01810000
IOPSUPNT EQU   IOPUDATA+104                                             01811000
IOPREQNT EQU   IOPUDATA+104                                             01812000
IOPIRQNT EQU   IOPUDATA+104                                             01813000
IOPFIDNT EQU   IOPUDATA+104                                             01814000
IOPDELNT EQU   IOPUDATA+104                                             01815000
IOPVERNT EQU   IOPUDATA+104                                             01816000
IOPSBYNT EQU   IOPUDATA+104                                             01817000
IOPQSMNT EQU   IOPUDATA                                                 01818000
IOPQSMDR EQU   IOPQSMNT                                                 01819000
IOPQFMNT EQU   IOPUDATA                                                 01820000
IOPQFMDR EQU   IOPQFMNT                                                 01821000
IOPQFEND EQU   IOPQFMNT+2                                               01822000
IOPQFMVR EQU   IOPQFEND                                                 01823000
IOPQFMLS EQU   IOPQFMVR                                                 01824000
IOPQFMNM EQU   IOPQFMLS                                                 01825000
IOPPTSYS EQU   IOPUDATA                                                 01826000
IOPPTSDR EQU   IOPPTSYS                                                 01827000
IOPPTPEM EQU   IOPPTSDR+2                                               01828000
IOPPTSFX EQU   IOPPTSYS+24                                              01829000
IOPDSSPC EQU   IOPPTSFX                                                 01830000
IOPSYPLN EQU   IOPPTSFX+32                                              01831000
IOPPTFG1 EQU   IOPPTSFX+34                                              01832000
IOPPTSNP EQU   IOPPTFG1                                                 01833000
IOPPTSNJ EQU   IOPPTFG1                                                 01834000
IOPSYASM EQU   IOPPTSFX+53                                              01835000
IOPSYASS EQU   IOPPTSFX+61                                              01836000
IOPSYASR EQU   IOPPTSFX+69                                              01837000
IOPSYASP EQU   IOPPTSFX+70                                              01838000
IOPSYCOM EQU   IOPPTSFX+170                                             01839000
IOPSYCOS EQU   IOPPTSFX+178                                             01840000
IOPSYCOR EQU   IOPPTSFX+186                                             01841000
IOPSYCOP EQU   IOPPTSFX+187                                             01842000
IOPSYCPY EQU   IOPPTSFX+287                                             01843000
IOPSYCPS EQU   IOPPTSFX+295                                             01844000
IOPSYCPR EQU   IOPPTSFX+303                                             01845000
IOPSYCPP EQU   IOPPTSFX+304                                             01846000
IOPSYLKD EQU   IOPPTSFX+404                                             01847000
IOPSYLKS EQU   IOPPTSFX+412                                             01848000
IOPSYLKR EQU   IOPPTSFX+420                                             01849000
IOPSYLKP EQU   IOPPTSFX+421                                             01850000
IOPSYSUP EQU   IOPPTSFX+521                                             01851000
IOPSYSPS EQU   IOPPTSFX+529                                             01852000
IOPSYSPR EQU   IOPPTSFX+537                                             01853000
IOPSYSPP EQU   IOPPTSFX+538                                             01854000
IOPSYUPD EQU   IOPPTSFX+638                                             01855000
IOPSYUPS EQU   IOPPTSFX+646                                             01856000
IOPSYUPR EQU   IOPPTSFX+654                                             01857000
IOPSYUPP EQU   IOPPTSFX+655                                             01858000
IOPSYZAP EQU   IOPPTSFX+755                                             01859000
IOPSYZPS EQU   IOPPTSFX+763                                             01860000
IOPSYZPR EQU   IOPPTSFX+771                                             01861000
IOPSYZPP EQU   IOPPTSFX+772                                             01862000
IOPPSEND EQU   IOPPTSYS+1064                                            01863000
IOPPTSVR EQU   IOPPSEND                                                 01864000
IOPPTNTR EQU   IOPPTSVR                                                 01865000
@NM00164 EQU   IOPPTNTR                                                 01866000
IOPPTFMD EQU   @NM00164                                                 01867000
IOPPTREL EQU   IOPPTFMD                                                 01868000
IOPBPDS  EQU   IOPUDATA                                                 01869000
IOPBLEP1 EQU   IOPBPDS+8                                                01870000
IOPBLEP2 EQU   IOPBPDS+9                                                01871000
@NM00168 EQU   IOPBPDS+18                                               01872000
IOPBFTB0 EQU   @NM00168                                                 01873000
IOPBFTB1 EQU   IOPBFTB0                                                 01874000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01875000
IOPBCEND EQU   IOPBPDS+21                                               01876000
IOPBFTB3 EQU   IOPBFTB0+2                                               01877000
IOPBFTB2 EQU   IOPBFTB0+1                                               01878000
@NM00170 EQU   IOPBFTB1                                                 01879000
IOPBAPFP EQU   IOPBFTB1                                                 01880000
IOPBSSI  EQU   IOPBFTB1                                                 01881000
IOPBPAGA EQU   IOPBFTB1                                                 01882000
@NM00169 EQU   IOPBFTB1                                                 01883000
IOPBAOSL EQU   IOPBFTB1                                                 01884000
IOPBSEPA EQU   IOPBPDS+15                                               01885000
IOPBFTBL EQU   IOPBPDS+13                                               01886000
IOPBSTOR EQU   IOPBPDS+10                                               01887000
IOPBREFR EQU   IOPBLEP2                                                 01888000
IOPBLEF  EQU   IOPBLEP2                                                 01889000
IOPBTEST EQU   IOPBLEP2                                                 01890000
IOPBNE   EQU   IOPBLEP2                                                 01891000
@NM00167 EQU   IOPBLEP2                                                 01892000
IOPBDC   EQU   IOPBLEP2                                                 01893000
@NM00166 EQU   IOPBLEP1                                                 01894000
IOPBSCTR EQU   IOPBLEP1                                                 01895000
IOPBOL   EQU   IOPBLEP1                                                 01896000
@NM00165 EQU   IOPBLEP1                                                 01897000
IOPBOVLY EQU   IOPBLEP1                                                 01898000
IOPBREUS EQU   IOPBLEP1                                                 01899000
IOPBRENT EQU   IOPBLEP1                                                 01900000
IOPBNL   EQU   IOPBPDS+7                                                01901000
IOPBTTRN EQU   IOPBPDS+4                                                01902000
IOPBZERO EQU   IOPBPDS+3                                                01903000
IOPBTTRT EQU   IOPBPDS                                                  01904000
IOPPTIND EQU   IOPPTNTR+8                                               01905000
IOPPTSND EQU   IOPPTREL                                                 01906000
@NM00163 EQU   IOPPTSFX+872                                             01907000
@NM00162 EQU   IOPPTSFX+35                                              01908000
@NM00161 EQU   IOPPTFG1                                                 01909000
IOPDSPFX EQU   IOPPTSFX+6                                               01910000
IOPDSDIR EQU   IOPDSSPC+4                                               01911000
IOPDSSEC EQU   IOPDSSPC+2                                               01912000
IOPDSPRM EQU   IOPDSSPC                                                 01913000
@NM00160 EQU   IOPPTSDR+4                                               01914000
IOPPCNVL EQU   IOPPTSDR+1                                               01915000
@NM00159 EQU   IOPPTSDR                                                 01916000
IOPQFMTP EQU   IOPQFMLS+8                                               01917000
@NM00158 EQU   IOPQFMLS+7                                               01918000
IOPQFMND EQU   IOPQFMNM                                                 01919000
@NM00157 EQU   IOPQFMDR                                                 01920000
@NM00153 EQU   IOPQSMDR                                                 01921000
@NM00152 EQU   IOPSBYNT+8                                               01922000
IOPSBYST EQU   IOPSBYNT+7                                               01923000
IOPSBYNM EQU   IOPSBYNT                                                 01924000
@NM00151 EQU   IOPVERNT+8                                               01925000
IOPVERST EQU   IOPVERNT+7                                               01926000
IOPVERNM EQU   IOPVERNT                                                 01927000
@NM00150 EQU   IOPDELNT+8                                               01928000
IOPDELST EQU   IOPDELNT+7                                               01929000
IOPDELNM EQU   IOPDELNT                                                 01930000
@NM00149 EQU   IOPFIDNT+8                                               01931000
IOPFIDST EQU   IOPFIDNT+7                                               01932000
IOPFIDNM EQU   IOPFIDNT                                                 01933000
@NM00148 EQU   IOPIRQNT+8                                               01934000
IOPIRQST EQU   IOPIRQNT+7                                               01935000
IOPIRQNM EQU   IOPIRQNT                                                 01936000
@NM00147 EQU   IOPREQNT+8                                               01937000
IOPREQST EQU   IOPREQNT+7                                               01938000
IOPREQNM EQU   IOPREQNT                                                 01939000
@NM00146 EQU   IOPSUPNT+8                                               01940000
IOPSUPST EQU   IOPSUPNT+7                                               01941000
IOPSUPNM EQU   IOPSUPNT                                                 01942000
@NM00145 EQU   IOPNPRNT+8                                               01943000
IOPNPRST EQU   IOPNPRNT+7                                               01944000
IOPNPRNM EQU   IOPNPRNT                                                 01945000
@NM00144 EQU   IOPPRENT+8                                               01946000
IOPPREST EQU   IOPPRENT+7                                               01947000
IOPPRENM EQU   IOPPRENT                                                 01948000
@NM00143 EQU   IOPSRLNT+8                                               01949000
IOPSRLST EQU   IOPSRLNT+7                                               01950000
@NM00142 EQU   IOPSRLNT+4                                               01951000
IOPSRLNM EQU   IOPSRLNT                                                 01952000
@NM00141 EQU   IOPENTNT+8                                               01953000
IOPENTST EQU   IOPENTNT+7                                               01954000
IOPENTNM EQU   IOPENTNT                                                 01955000
IOPPIND  EQU   IOPPNTRY+8                                               01956000
IOPPTFND EQU   IOPPMODS                                                 01957000
IOPPFMID EQU   IOPPTFFX+73                                              01958000
@NM00140 EQU   IOPPTPFX+24                                              01959000
IOPUCLT  EQU   IOPDATES+21                                              01960000
IOPUCLD  EQU   IOPDATES+18                                              01961000
IOPACCT  EQU   IOPDATES+15                                              01962000
IOPACCD  EQU   IOPDATES+12                                              01963000
IOPRSTT  EQU   IOPDATES+9                                               01964000
IOPRSTD  EQU   IOPDATES+6                                               01965000
IOPAPPT  EQU   IOPDATES+3                                               01966000
IOPAPPD  EQU   IOPDATES                                                 01967000
IOPRECT  EQU   @NM00139+3                                               01968000
IOPRECD  EQU   @NM00139                                                 01969000
@NM00138 EQU   IOPPTFFX+8                                               01970000
@NM00137 EQU   @NM00135+7                                               01971000
IOPPRELN EQU   @NM00136                                                 01972000
@NM00134 EQU   IOPPTFDR+20                                              01973000
IOPSBYNO EQU   IOPPTFDR+13                                              01974000
IOPDBYNO EQU   IOPPTFDR+6                                               01975000
@NM00133 EQU   IOPPTFF3                                                 01976000
IOPFLF   EQU   IOPPTFF3                                                 01977000
IOPDBYP  EQU   IOPPTFF3                                                 01978000
IOPSBYP  EQU   IOPPTFF3                                                 01979000
IOPPMDLP EQU   IOPPTFF2+1                                               01980000
IOPPADDP EQU   IOPPTFF2+1                                               01981000
@NM00132 EQU   IOPPTFF2+1                                               01982000
IOPLRFP  EQU   IOPPTFF2                                                 01983000
IOPJCLP  EQU   IOPPTFF2                                                 01984000
IOPSUPP  EQU   IOPPTFF2                                                 01985000
IOPREQP  EQU   IOPPTFF2                                                 01986000
IOPPREP  EQU   IOPPTFF2                                                 01987000
IOPNPRP  EQU   IOPPTFF2                                                 01988000
IOPIRQP  EQU   IOPPTFF2                                                 01989000
IOPDELP  EQU   IOPPTFF2                                                 01990000
IOPREGEN EQU   IOPFLGS5                                                 01991000
IOPBYP   EQU   IOPFLGS5                                                 01992000
IOPDUMMP EQU   IOPFLGS5                                                 01993000
@NM00131 EQU   IOPFLGS5                                                 01994000
IOPERROR EQU   IOPFLGS5                                                 01995000
IOPACC   EQU   IOPFLGS5                                                 01996000
IOPRES   EQU   IOPFLGS5                                                 01997000
IOPAPP   EQU   IOPFLGS5                                                 01998000
IOPPTYPE EQU   IOPPTFDR+1                                               01999000
@NM00130 EQU   IOPPTFDR                                                 02000000
IOPSYSTP EQU   IOPSYSTR+8                                               02001000
IOPSYSND EQU   IOPSYNTR                                                 02002000
@NM00129 EQU   IOPSYSFX+21                                              02003000
@NM00128 EQU   @NM00126+7                                               02004000
@NM00127 EQU   @NM00126                                                 02005000
@NM00125 EQU   IOPSYSDR+5                                               02006000
@NM00124 EQU   IOPFLGS7                                                 02007000
@NM00123 EQU   IOPSYSDR                                                 02008000
IOPDLIND EQU   IOPDNTRY+8                                               02009000
IOPDLBND EQU   IOPDSYS                                                  02010000
@NM00122 EQU   IOPDLBFX+8                                               02011000
@NM00121 EQU   @NM00119+7                                               02012000
@NM00120 EQU   @NM00119                                                 02013000
@NM00118 EQU   IOPDLBDR+1                                               02014000
@NM00117 EQU   IOPDLBDR                                                 02015000
IOPMDIND EQU   IOPMNTRY+8                                               02016000
@NM00116 EQU   IOPMODST                                                 02017000
IOPMODND EQU   IOPMODID                                                 02018000
IOPDLIB  EQU   IOPMODFX+72                                              02019000
@NM00115 EQU   IOPMODFX+12                                              02020000
@NM00114 EQU   IOPMODF4                                                 02021000
@NM00113 EQU   IOPMODF3                                                 02022000
@NM00112 EQU   IOPMODF2                                                 02023000
IOPMPAGA EQU   IOPMODF2                                                 02024000
IOPMNE   EQU   IOPMODF2                                                 02025000
@NM00111 EQU   IOPMODF1                                                 02026000
IOPMDC   EQU   IOPMODF1                                                 02027000
IOPMREFR EQU   IOPMODF1                                                 02028000
IOPMOVLY EQU   IOPMODF1                                                 02029000
IOPMSCTR EQU   IOPMODF1                                                 02030000
IOPMREUS EQU   IOPMODF1                                                 02031000
IOPMRENT EQU   IOPMODF1                                                 02032000
IOPMAPF  EQU   IOPMODF1                                                 02033000
@NM00110 EQU   @NM00108+7                                               02034000
@NM00109 EQU   @NM00108                                                 02035000
@NM00107 EQU   IOPMODDR+17                                              02036000
@NM00106 EQU   @NM00104+7                                               02037000
@NM00105 EQU   @NM00104                                                 02038000
@NM00103 EQU   @NM00100                                                 02039000
@NM00102 EQU   @NM00100                                                 02040000
@NM00101 EQU   @NM00100                                                 02041000
@NM00099 EQU   @NM00098                                                 02042000
@NM00097 EQU   IOPMODDR                                                 02043000
IOPSRIND EQU   IOPSNTRY+8                                               02044000
@NM00096 EQU   IOPSRCST                                                 02045000
IOPSRCND EQU   IOPSRCID                                                 02046000
IOPSRDLB EQU   IOPSRCFX+72                                              02047000
IOPSRSYS EQU   IOPSRCFX+64                                              02048000
@NM00095 EQU   IOPSRCFX+8                                               02049000
@NM00094 EQU   @NM00092+7                                               02050000
@NM00093 EQU   @NM00092                                                 02051000
@NM00091 EQU   IOPSRCDR+18                                              02052000
IOPSRLNG EQU   IOPSRCDR+17                                              02053000
@NM00090 EQU   @NM00088+7                                               02054000
@NM00089 EQU   @NM00088                                                 02055000
@NM00087 EQU   @NM00084                                                 02056000
@NM00086 EQU   @NM00084                                                 02057000
@NM00085 EQU   @NM00084                                                 02058000
@NM00083 EQU   @NM00082                                                 02059000
@NM00081 EQU   IOPSRCDR                                                 02060000
IOPEOFND EQU   IOPEOFNT                                                 02061000
IOPMCTYP EQU   IOPMCIND                                                 02062000
@NM00080 EQU   IOPMACST                                                 02063000
IOPMACND EQU   IOPMACID                                                 02064000
IOPMCDLB EQU   IOPMACFX+72                                              02065000
IOPMCSYS EQU   IOPMACFX+64                                              02066000
@NM00079 EQU   IOPMACFX+8                                               02067000
IOPBUTYP EQU   IOPBUNT+7                                                02068000
IOPBUSMD EQU   IOPBUNT                                                  02069000
@NM00078 EQU   IOPMACDR+18                                              02070000
IOPMCLNG EQU   IOPMACDR+17                                              02071000
IOPFMST  EQU   IOPFMIDE+7                                               02072000
IOPFMID  EQU   IOPFMIDE                                                 02073000
@NM00077 EQU   IOPRMST                                                  02074000
IOPRMASM EQU   IOPRMST                                                  02075000
@NM00076 EQU   IOPRMST                                                  02076000
IOPRMID  EQU   IOPRMIDE                                                 02077000
@NM00075 EQU   IOPMACDR                                                 02078000
IOPLMIND EQU   IOPLNTRY+8                                               02079000
IOPLMDND EQU   IOPSYSLB                                                 02080000
@NM00073 EQU   @NM00071+7                                               02081000
@NM00072 EQU   @NM00071                                                 02082000
@NM00070 EQU   IOPLMDDR+6                                               02083000
@NM00069 EQU   IOPFLGS3                                                 02084000
IOPCHREP EQU   IOPFLGS3                                                 02085000
IOPLINK  EQU   IOPFLGS3                                                 02086000
IOPCOPY  EQU   IOPFLGS3                                                 02087000
@NM00068 EQU   IOPLMDF4                                                 02088000
@NM00067 EQU   IOPLMDF3                                                 02089000
@NM00066 EQU   IOPLMDF2                                                 02090000
IOPPAGA  EQU   IOPLMDF2                                                 02091000
IOPNE    EQU   IOPLMDF2                                                 02092000
@NM00065 EQU   IOPFLGS2                                                 02093000
IOPDC    EQU   IOPFLGS2                                                 02094000
IOPREFR  EQU   IOPFLGS2                                                 02095000
IOPOVLY  EQU   IOPFLGS2                                                 02096000
IOPSCTR  EQU   IOPFLGS2                                                 02097000
IOPREUS  EQU   IOPFLGS2                                                 02098000
IOPRENT  EQU   IOPFLGS2                                                 02099000
IOPAPF   EQU   IOPFLGS2                                                 02100000
@NM00064 EQU   IOPLMDDR                                                 02101000
@NM00063 EQU   IOPASMDR+9                                               02102000
IOPABUTP EQU   IOPABUNT+7                                               02103000
IOPABUPT EQU   IOPABUNT                                                 02104000
IOPNTLVL EQU   IOPASMDR                                                 02105000
IOPALLOC EQU   @NM00062+4                                               02106000
IOPUSED  EQU   @NM00062                                                 02107000
IOPTPSEQ EQU   @NM00061+8                                               02108000
IOPVLSER EQU   @NM00061+2                                               02109000
IOPBLKSI EQU   @NM00061                                                 02110000
IOPCQMAX EQU   IOPCQMAP+12                                              02111000
@NM00060 EQU   IOPCQMAP+11                                              02112000
@NM00059 EQU   IOPCQMAP+8                                               02113000
@NM00058 EQU   IOPCQMAP                                                 02114000
IOPPTMAX EQU   IOPCDMAX                                                 02115000
@NM00057 EQU   IOPSCMAP+11                                              02116000
@NM00056 EQU   IOPSCMAP+8                                               02117000
@NM00055 EQU   IOPSCMAP                                                 02118000
IOPDIRMX EQU   IOPNTMAX+12                                              02119000
@NM00054 EQU   IOPNTMAX+11                                              02120000
@NM00053 EQU   IOPNTMAX+8                                               02121000
@NM00052 EQU   IOPNTMAX                                                 02122000
@NM00051 EQU   IOPDTYPE                                                 02123000
IOPDMOD  EQU   IOPDTYPE                                                 02124000
IOPDJCL  EQU   IOPDTYPE                                                 02125000
IOPDSRC  EQU   IOPDTYPE                                                 02126000
IOPDMAC  EQU   IOPDTYPE                                                 02127000
IOPSDIR  EQU   IOPSPACE+4                                               02128000
IOPSSCND EQU   IOPSPACE+2                                               02129000
IOPSPRIM EQU   IOPSPACE                                                 02130000
IOPDSN   EQU   IOPDYNDT                                                 02131000
IOPNTYPE EQU   IOPSTCMP+17                                              02132000
IOPNNAME EQU   IOPSTCMP+9                                               02133000
IOPOTYPE EQU   IOPSTCMP+8                                               02134000
IOPONAME EQU   IOPSTCMP                                                 02135000
IOPISEQ3 EQU   IOPINAM3+6                                               02136000
IOPITYP3 EQU   @NM00050+5                                               02137000
IOPIPTF3 EQU   @NM00050                                                 02138000
CCAEND   EQU   HMASMCCA+371                                             02139000
@NM00024 EQU   HMASMCCA+309                                             02140000
CCACURDD EQU   CCAFDSNG+3                                               02141000
CCACURDS EQU   CCAFDSNG+2                                               02142000
@NM00023 EQU   CCAFLAGB                                                 02143000
CCAOUTNG EQU   CCAFLAGB                                                 02144000
CCALOGNG EQU   CCAFLAGB                                                 02145000
CCAFMID  EQU   HMASMCCA+291                                             02146000
CCALSTDS EQU   CCAFCTL+8                                                02147000
CCARPTDS EQU   CCAFCTL+7                                                02148000
CCATIME  EQU   CCAFCTL+4                                                02149000
CCADATE  EQU   CCAFCTL+1                                                02150000
@NM00022 EQU   CCAFLAG9                                                 02151000
CCARVCAN EQU   CCAFLAG9                                                 02152000
CCARVEST EQU   CCAFLAG9                                                 02153000
@NM00021 EQU   CCAFLAG8                                                 02154000
@NM00020 EQU   CCAFLAG6                                                 02155000
CCAACRUP EQU   CCAFLAG6                                                 02156000
CCACRQUP EQU   CCAFLAG6                                                 02157000
CCAACDUP EQU   CCAFLAG6                                                 02158000
CCACDSUP EQU   CCAFLAG6                                                 02159000
@NM00019 EQU   CCAFLAG5                                                 02160000
CCAACROS EQU   CCAFLAG5                                                 02161000
CCACRQOS EQU   CCAFLAG5                                                 02162000
CCAACDOS EQU   CCAFLAG5                                                 02163000
CCACDSOS EQU   CCAFLAG5                                                 02164000
@NM00018 EQU   CCAFLAG4                                                 02165000
CCAACRIS EQU   CCAFLAG4                                                 02166000
CCACRQIS EQU   CCAFLAG4                                                 02167000
CCAACDIS EQU   CCAFLAG4                                                 02168000
CCACDSIS EQU   CCAFLAG4                                                 02169000
@NM00017 EQU   CCAFLAG3+1                                               02170000
CCARGNP  EQU   CCAFLAG3+1                                               02171000
CCADISRQ EQU   CCAFLAG3+1                                               02172000
CCAICTOK EQU   CCAFLAG3                                                 02173000
CCADELP  EQU   CCAFLAG3                                                 02174000
CCACMPRS EQU   CCAFLAG3                                                 02175000
CCAZAPP  EQU   CCAFLAG3                                                 02176000
CCALINKP EQU   CCAFLAG3                                                 02177000
CCACOPYP EQU   CCAFLAG3                                                 02178000
CCAASIP  EQU   CCAFLAG3                                                 02179000
CCAUPDP  EQU   CCAFLAG3                                                 02180000
CCAEOSMP EQU   CCAFLAG2                                                 02181000
CCAEOFNC EQU   CCAFLAG2                                                 02182000
@NM00016 EQU   CCAFLAG2                                                 02183000
CCACHECK EQU   CCAFLAG2                                                 02184000
CCATERM  EQU   CCAFLAG2                                                 02185000
CCASVCLB EQU   CCAFLAG2                                                 02186000
CCANCPTF EQU   CCAFLAG2                                                 02187000
@NM00015 EQU   CCAFLAG1+1                                               02188000
CCAUNL   EQU   CCAFLAG1+1                                               02189000
CCARESET EQU   CCAFLAG1+1                                               02190000
CCALOG   EQU   CCAFLAG1+1                                               02191000
CCACNV   EQU   CCAFLAG1+1                                               02192000
CCALIST  EQU   CCAFLAG1                                                 02193000
CCAUPDJ  EQU   CCAFLAG1                                                 02194000
CCARES   EQU   CCAFLAG1                                                 02195000
CCAREJ   EQU   CCAFLAG1                                                 02196000
CCAACCPT EQU   CCAFLAG1                                                 02197000
CCAAPPLY EQU   CCAFLAG1                                                 02198000
CCAREC   EQU   CCAFLAG1                                                 02199000
CCAFUNCT EQU   CCAFFUNC                                                 02200000
@NM00014 EQU   @NM00009+18                                              02201000
@NM00013 EQU   @NM00009+16                                              02202000
CCATBLPA EQU   @NM00009+12                                              02203000
@NM00012 EQU   @NM00009+8                                               02204000
@NM00011 EQU   @NM00009+4                                               02205000
@NM00010 EQU   @NM00009                                                 02206000
CCAIFGTP EQU   CCAFGTP+16                                               02207000
CCAGTP3  EQU   CCAFGTP+12                                               02208000
CCAGTP2  EQU   CCAFGTP+8                                                02209000
CCAGTP1  EQU   CCAFGTP+4                                                02210000
CCASETAD EQU   CCASEGTP                                                 02211000
CCACLST  EQU   CCAFPGM+12                                               02212000
CCASPDCB EQU   CCAFPGM+8                                                02213000
CCAICLMD EQU   CCAFICT+12                                               02214000
CCAICMOD EQU   CCAFICT+8                                                02215000
CCAICPTF EQU   CCAFICT+4                                                02216000
CCAICT   EQU   CCAFICT                                                  02217000
CCARVAD  EQU   CCAFSTA                                                  02218000
@NM00008 EQU   CCAFLAGA                                                 02219000
CCAPESIZ EQU   CCAFIOP+4                                                02220000
@NM00007 EQU   CCAFLAG7+3                                               02221000
CCALOGP  EQU   CCAFLAG7+2                                               02222000
CCAOUTP  EQU   CCAFLAG7+2                                               02223000
CCASLBP  EQU   CCAFLAG7+2                                               02224000
CCARPTP  EQU   CCAFLAG7+2                                               02225000
CCALISTP EQU   CCAFLAG7+2                                               02226000
CCAJCLP  EQU   CCAFLAG7+2                                               02227000
CCAPTFP  EQU   CCAFLAG7+2                                               02228000
CCATLBP  EQU   CCAFLAG7+2                                               02229000
CCAUT3P  EQU   CCAFLAG7+1                                               02230000
CCAUT2P  EQU   CCAFLAG7+1                                               02231000
CCAUT1P  EQU   CCAFLAG7+1                                               02232000
CCAWK5P  EQU   CCAFLAG7+1                                               02233000
CCAWK4P  EQU   CCAFLAG7+1                                               02234000
CCAWK3P  EQU   CCAFLAG7+1                                               02235000
CCAWK2P  EQU   CCAFLAG7+1                                               02236000
CCAWK1P  EQU   CCAFLAG7+1                                               02237000
CCAACRQP EQU   CCAFLAG7                                                 02238000
CCACRQP  EQU   CCAFLAG7                                                 02239000
CCASTSP  EQU   CCAFLAG7                                                 02240000
CCAMTSP  EQU   CCAFLAG7                                                 02241000
CCAPTSP  EQU   CCAFLAG7                                                 02242000
CCASCDSP EQU   CCAFLAG7                                                 02243000
CCAACDSP EQU   CCAFLAG7                                                 02244000
CCACDSP  EQU   CCAFLAG7                                                 02245000
@NM00006 EQU   CCAFBUFR+122                                             02246000
@NM00005 EQU   CCAFBUFR+120                                             02247000
@NM00004 EQU   CCAFBUFR+118                                             02248000
CCATBFMX EQU   CCAFBUFR+116                                             02249000
CCA4BFMX EQU   CCAFBUFR+114                                             02250000
CCA3BFMX EQU   CCAFBUFR+112                                             02251000
CCA2BFMX EQU   CCAFBUFR+110                                             02252000
CCA1BFMX EQU   CCAFBUFR+108                                             02253000
CCAXBFMX EQU   CCAFBUFR+106                                             02254000
CCAQBFMX EQU   CCAFBUFR+104                                             02255000
CCASBFMX EQU   CCAFBUFR+102                                             02256000
CCAMBFMX EQU   CCAFBUFR+100                                             02257000
CCAPBFMX EQU   CCAFBUFR+98                                              02258000
CCAVBFMX EQU   CCAFBUFR+96                                              02259000
CCAABFMX EQU   CCAFBUFR+94                                              02260000
CCACBFMX EQU   CCAFBUFR+92                                              02261000
@NM00003 EQU   CCAFBUFR+88                                              02262000
@NM00002 EQU   CCAFBUFR+84                                              02263000
CCA4BFSZ EQU   CCAFBUFR+80                                              02264000
CCATBFSZ EQU   CCAFBUFR+76                                              02265000
CCAWBFSZ EQU   CCAFBUFR+72                                              02266000
CCAQBFSZ EQU   CCAFBUFR+68                                              02267000
CCAPBFSZ EQU   CCAFBUFR+64                                              02268000
CCAVBFSZ EQU   CCAFBUFR+60                                              02269000
CCACBFSZ EQU   CCAFBUFR+56                                              02270000
@NM00001 EQU   CCAFBUFR+52                                              02271000
CCA4BFOA EQU   CCAFBUFR+48                                              02272000
CCA4BFIA EQU   CCAFBUFR+44                                              02273000
CCATBFIA EQU   CCAFBUFR+40                                              02274000
CCAWBFOA EQU   CCAFBUFR+36                                              02275000
CCAWBFIA EQU   CCAFBUFR+32                                              02276000
CCAQBFOA EQU   CCAFBUFR+28                                              02277000
CCAQBFIA EQU   CCAFBUFR+24                                              02278000
CCAPBFOA EQU   CCAFBUFR+20                                              02279000
CCAPBFIA EQU   CCAFBUFR+16                                              02280000
CCAVBFOA EQU   CCAFBUFR+12                                              02281000
CCAVBFIA EQU   CCAFBUFR+8                                               02282000
CCACBFOA EQU   CCAFBUFR+4                                               02283000
CCACBFIA EQU   CCAFBUFR                                                 02284000
CCAID    EQU   HMASMCCA                                                 02285000
SPLIFIL  EQU   SPLODSN+33                                               02286000
SPLISMD  EQU   SPLODSN+26                                               02287000
SPLIPFX  EQU   SPLODSN                                                  02288000
SPLIUNPK EQU   SPLPUNPK+8                                               02289000
SPLOUNPK EQU   SPLPUNPK                                                 02290000
SPLOPACK EQU   SPLPPACK+8                                               02291000
SPLIPACK EQU   SPLPPACK                                                 02292000
IOPBS04E EQU   IOPBS04+2                                                02293000
IOPBAPFC EQU   IOPBAPF+1                                                02294000
IOPBAPFL EQU   IOPBAPF                                                  02295000
IOPBS2NM EQU   IOPBS02+3                                                02296000
IOPBS2EP EQU   IOPBS02                                                  02297000
IOPQSMTP EQU   IOPQSMLS+8                                               02298000
@NM00156 EQU   IOPQSMLS+7                                               02299000
IOPQSMND EQU   IOPQSMNM                                                 02300000
@NM00155 EQU   @NM00154+7                                               02301000
IOPQSMFM EQU   @NM00154                                                 02302000
@NM00074 EQU   IOPLMCTL+17                                              02303000
IOPLMCRD EQU   IOPLMCTL+9                                               02304000
IOPLMCRN EQU   IOPLMCTL+1                                               02305000
IOPLMCC  EQU   IOPLMCTL                                                 02306000
@NM00049 EQU   IOPUSERL                                                 02307000
@NM00048 EQU   IOPUSERL                                                 02308000
IOPALIS  EQU   IOPUSERL                                                 02309000
IOPTTR   EQU   IOPDRMAP+8                                               02310000
IOPINAM2 EQU   IOPINAM+1                                                02311000
IOPITYP2 EQU   IOPITYP                                                  02312000
@NM00047 EQU   HMASMIOP+32                                              02313000
IOPDELDD EQU   IOPDDNAM                                                 02314000
@NM00046 EQU   @NM00043+10                                              02315000
IOPSEQNO EQU   @NM00043+8                                               02316000
@NM00045 EQU   @NM00044+7                                               02317000
IOPPTFNM EQU   @NM00044                                                 02318000
IOPNAM17 EQU   IOPNAME                                                  02319000
CCABMREC EQU   CCABELMT+10                                              02320000
CCABPOS  EQU   CCABMPOS+8                                               02321000
CCABNAME EQU   CCABMPOS                                                 02322000
@NM00042 EQU   CCABLDLM+2                                               02323000
@NM00041 EQU   CCABLDLM                                                 02324000
@NM00040 EQU   @NM00039+21                                              02325000
CCAUPDTE EQU   @NM00039+8                                               02326000
@NM00038 EQU   @NM00037+21                                              02327000
CCAIOSUP EQU   @NM00037+8                                               02328000
@NM00036 EQU   @NM00035+21                                              02329000
CCASPZAP EQU   @NM00035+8                                               02330000
@NM00034 EQU   @NM00033+21                                              02331000
CCACOMRS EQU   @NM00033+8                                               02332000
@NM00032 EQU   @NM00031+21                                              02333000
CCACOPY  EQU   @NM00031+8                                               02334000
@NM00030 EQU   @NM00029+21                                              02335000
CCAASM   EQU   @NM00029+8                                               02336000
@NM00028 EQU   @NM00027+21                                              02337000
CCALKED  EQU   @NM00027+8                                               02338000
CCAPGMPM EQU   @NM00025+24                                              02339000
@NM00026 EQU   @NM00025+21                                              02340000
CCABPGRC EQU   @NM00025+20                                              02341000
CCABPGSP EQU   @NM00025+12                                              02342000
CCABPGAD EQU   @NM00025+8                                               02343000
CCABPGNM EQU   @NM00025                                                 02344000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02345000
@RC00271 EQU   @RC00269                                                 02346000
@RF00360 EQU   @RC00350                                                 02347000
@RF00373 EQU   @RC00367                                                 02348000
@RF00455 EQU   @RC00453                                                 02349000
@RF00279 EQU   @RC00271                                                 02350000
@ENDDATA EQU   *                                                        02351000
         END   HMASMDS1,(C'PLS2013',0802,78334)                         02352000
